import "./App.css";
import "@fontsource/roboto";
import AddProject from "./pages/add-project/AddProject";
import { BrowserRouter, Route, Switch } from "react-router-dom";
import AllProjects from "./pages/all-projects/AllProjects";
import Navbar from "./components/navbar/Navbar";
import EditProject from "./pages/edit-project/EditProject";
import SignIn from "./pages/sign-in/SignIn";
import TeacherProjects from "./pages/teacher-projects/TeacherProjects";
import DisplayProject from "./pages/display-project/DisplayProject";
import Axios from "axios";
import { useEffect } from "react";
import { useDispatch } from "react-redux";
import { teacherLogin } from "./redux/securitySlice";

// const a = [
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e482",
//     workshopId: "613ce0fd6b3ab6b59152e489",
//     title: "Fix4U",
//     imageSrc:
//       "https://static.wixstatic.com/media/d8d183_731a0995a1714a908a78a8d7b73d29e4~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210305",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "דניאל קהלני שי אברהם שגיא אהרון",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גבר טומה',
//         value: ":שם המנחה",
//       },
//       {
//         key: "Home Communication",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/Daniel-Kahalani/Fix4U",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "המקרר התקלקל ? הכיור נסתם ? נמאס לכם לחכות ימים שלמים עד שהטכנאי מגיע אליכם הביתה ? האפליקציה Fix4U נועדה לתת מענה על הצורך המיידי ומוצאת עבורך את בעל המקצוע האמין והמתאים ובזמן הקצר ביותר.\n\nבעל מקצוע? מחפש להרחיב את מאגר הלקוחות? מעוניין לשפר את חווית ניהול העסק?\n\nהאפליקציה Fix4U מספקת עבורך ממשק נוח לניהול והרחבת העסק.\n\nהלקוח יכול לבצע חיפוש מהיר של בעל מקצוע המתאים לפי רשימת פרמטרים לסינון כגון זמינות, דירוג, היסטוריית ביקורים ועוד. על כל בעל מקצוע יוצג מידע כגון פרטים אישיים, מחיר ביקור וביקורות של לקוחות קודמים.\n\nמנגד, לבעל המקצוע מוצג יומן המכיל את כל הביקורים שנקבעו לו וסטטיסטיקות ומידעים שונים אודות היסטוריית הביקורים שלו כגון תקלות חוזרות, ביקורים חוזרים וכו'.\n\nהפרויקט משתמש בטכנולוגיות הבאות: Native-React על מנת להתאים את האפליקציה לכל מערכות ההפעלה הנפוצות, ישנו שימוש בממשק Back4App המבוסס על Parse-Server המספק שירותים כגון Storage, Authentication, Database.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e482",
//     workshopId: "613ce0fd6b3ab6b59152e489",
//     title: "Flash Deals",
//     imageSrc:
//       "https://static.wixstatic.com/media/6af196_917fcd3392a44b96854b9901a156c700~mv2.png/v1/fill/w_274,h_161,al_c,lg_1,q_85/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210301",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "אור ג'רבי שירה דימניק",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גבר טומה',
//         value: ":שם המנחה",
//       },
//       {
//         key: "Home Communications",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/Gerbi83/flashdeals",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "אפליקציית Flash Deals מהווה פלטפורמה שמקשרת מוכרים וקונים בזמן אמת: המוכרים יכולים לפרסם בה מוצרים חדשים, מכירות מיוחדות, הנחות סוף עונה, הנחות סוף יום ועוד, והקונים יכולים להתעדכן בדילים לפי תחומי עניין ומרחק מביתם.\n\nבצד המוכרים כל מוכר מתחבר לאפליקציה בפעם הראשונה וממלא את פרטי החנות: שמה, תחום העניין שלה וכתובתה. מרגע שהקים המוכר משתמש באפליקציה הוא יכול לפרסם, לעדכן או לעצור דילים שיישלחו לקונים שבחרו את תחום העניין של החנות והתאימו מבחינת המרחק. היסטוריית הדילים נשמרת אצל המוכר.\n\nבצד הקונים כל קונה מגדיר את תחומי העניין שמעניינים אותו, המיקום המבוקש ומרחק ביחס למיקום. כך מתקבל עבור הקונה עמוד שמותאם לו (Feed) שכוללים את הדילים שמתאימים לו. הקונה יכול לשנות את ההגדרות בכל זמן שיבחר.\n\nהפרויקט נכתב כאפליקציית web בשפת Python על גבי Flask (web framework), התבצעה אינטגרציה לממשקים של Goggle: חיבור המשתמשים נעשה באמצעות API של Google Login והעבודה עם כתובות ומיקומים נעשה באמצעות API של Google Maps. נתוני המשתמשים והדילים נשמרו ב-Database של SQLAlchemy. השרת רץ על גבי שירותי ענן של AWS.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e482",
//     workshopId: "613ce0fd6b3ab6b59152e489",
//     title: "PLANTA",
//     imageSrc:
//       "https://static.wixstatic.com/media/87324d_2ad797ef193749b5a46f6f7be1968aff~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210302",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "רון עמבר ערן קמיל תומר פיקר הדר שעשוע",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גבר טומה',
//         value: ":שם המנחה",
//       },
//       {
//         key: "Home Communications",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "כל מי שמגדל צמחים ביתיים בוודאי שאל את עצמו את השאלות הבאות:\n\nהאם לצמח יש מספיק אור? האם הוא מקבל מספיק מים?\n\nכיום ניתן למצוא מידע לגבי תנאי גידול אופטימליים עבור צמחים רבים באתרי אינטרנט או דרך אנשי מקצוע.\n\nאך תנאי גידול אלה הם כללים עבור כל זן צמחים מסוים ולא מספקים חווי מדויק בזמן אמת האם הצמח בפועל קיבל את מה שדרוש לו על מנת לממש את פוטנציאל הגדילה שלו, בנוסף אנשים לעיתים שוכחים להשקות את הצמח בזמן שהומלץ.\n\nלכן מרבית הצמחים למעשה לא מקבלים את התנאים האופטימליים עבורם, דבר שלעיתים מוביל לקיצור מערכת היחסים בינם לבין המגדל המאוכזב.\n\nבדיוק לשם כך פיתחנו את PLANTA !\n\nבאמצעות חיישני אור ולחות המונחים בקרבת הצמח האפליקציה מאפשרת מעקב על כמות האור והלחות הנוכחיים בצמח מול התנאים האופטימליים הדרושים.\n\nבנוסף אם מגדל הצמח שכח להשקות את הצמח בזמן הוא יקבל התראה בזמן אמת על מנת למנוע פגיעה בצמח.\n\nבכך האפליקציה מאפשרת למגדלים לספק לצמחים שלהם את התנאים הדרושים ולהימנע מאכזבות מיותרות.\n\nבקרוב בחנויות האפליקציות.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e482",
//     workshopId: "613ce0fd6b3ab6b59152e489",
//     title: "Emergency Room Manager",
//     imageSrc:
//       "https://static.wixstatic.com/media/472ecb_6cc4779b52544bf6b3cd8d69bb985c15~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210303",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "נדב זלדין איתי גרטל",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גבר טומה',
//         value: ":שם המנחה",
//       },
//       {
//         key: "Home Communications",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'כאשר ניגשנו לפיתוח פרויקט גמר חיפשנו כיצד ניתן לתרום במאמץ במאבק הקורונה. במהלך החיפושים הגענו לפרופסור סיגל סבירי מנהלת היחידה לטפול נמרץ קורונה בבית החולים הדסה והצענו לה את עזרתינו וכך נולד פרויקט זה. \n כיום המחלקה מתנהלת בעומס רב וקיימת בעיה משמעותית של שימור ידע בניהול השוטף, בדגש בעת מעבר משמרת. לכן יעד המרכזי של הפרויקט הינו שיפור אופן הניהול השוטף מניעת איבוד ידע ופספוס בדיקות וטיפולים על ידי יצירת"זיכרון אירגוני" עבור טיפולי החולים במחלקה במערכת נוחה ופשוטה לרופא ואחות. \n פרויקט זה נותן מענה בשיפור הניהול השוטף של המחלקה ועיקרו מאפשר מעבר לניהול מתוקשב של המחלקה, פיתוחו בוצע בשיח שוטף מול מנהלי המחלקה ויצירת מספר גרסאות - פיתוחן והתאמתן על פי דרישות  הלקוחות, תהליך הפיתוח היה בצורת Agile עם חיכוך משמעותי של סיגל והצוות הרפואי. פרויקט זה מביא איתו יכולת שמירת הבדיקות והסטטוס שלהן עבור כל חולה בשילוב תצוגות חכמות ופשוטות וכך מאפשר לרופאי המחלקה הבנת הסטטוס של כל חולה ברגע הנוכחי, בנוסף - יכולת לתחקר לאחור ולקבל את הסטטוס של כל חולה אשר ביקר אי פעם במחלקה.\n הפרויקט היום בתהליכי הטמעה במחלקה של סיגל ומתוכננות גרסאות נוספות למול הבקשות הרבות של המחלקה.\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e482",
//     workshopId: "613ce0fd6b3ab6b59152e489",
//     title: "Kido",
//     imageSrc:
//       "https://static.wixstatic.com/media/02e77c_402d3d74f538449196b38a4559b20d0b~mv2.png/v1/fill/w_252,h_148,al_c,lg_1,q_85/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210304",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עדן בנימין אמיר חזן עומרי פורן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גבר טומה',
//         value: ":שם המנחה",
//       },
//       {
//         key: "Home Communications",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "מכירים את זה שאתם עם הילד שלכם בגינה הציבורית והוא רץ ומשתולל ואתם מושיטים יד רגע לתיק וכשאתם מרימים את הראש הוא נעלם? מכירים את זה שאתם בישיבה כמה שעות ושאתם יוצאים אתם בודקים את הטלפון הנייד שלכם ורואים כמה שיחות שלא נענו מהילד שלכם וכשאתם מחייגים חזרה הוא לא עונה? אפליקציית Kido נועדה לענות על הצורך לדעת היכן נמצא הילד שלכם בכל רגע נתון ולהרגיע אתכם כאשר אתם לא יודעים היכן הוא בדיוק.\nהאפליקצייה תאפשר לנו לצפות בכל רגע נתון היכן הילד נמצא , תאפשר לילד להפעיל התראה שתקפוץ בטלפון של ההורים בעת מצב חירום ולשלוח את המיקום שלו. האפליקצייה תכלול צ'אט שתאפשר לילד לתקשר עם ההורים שלו בכל רגע נתון באמצעות תכתובת.\nמצד הלקוח (ההורה) , לאחר רישום , האפליקצייה תאפשר מעקב באמצעות GPS אחר הילד ותשלח מיקום מדוייק שלו , תאפשר מעקב אחריו אם וכאשר הוא מתקדם , תאפשר שליחת הודעות אליו ומיקום נוכחי של הלקוח (ההורה) אם חפץ בכך.\nKido נוצרה מתוך הצורך להגן על הילדים שלכם , לדעת היכן הם מסתובבים , האם הם זקוקים לעזרה , האם הם במצוקה ובעיקר להרגיע את ההורה המודאג.\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e483",
//     workshopId: "613ce0fd6b3ab6b59152e48a",
//     title: "Kalena",
//     imageSrc:
//       "https://static.wixstatic.com/media/098395_762f6675324444faace20efc224f25e2~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211201",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "רונן חוטיינוב שירז וינר הדר ישראלי חן לוגסי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קרקובסקי רועי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "ארכיטקטורות ביג דאטה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "Kalena הינה אפליקציית WEB ליצירת לוח שנה אישי וסטודנטיאלי המסונכרן מול מערכת השעות של המכללה.\nהאפליקציה מאפשרת למשתמשים לנהל לוח זמנים אישי, לקבוע פגישות מול משתמשים אחרים בעזרת זימון לפגישה מסודרת שתופיע בלו\"ז של המשתתפים לאחר אישור הבקשה, או בעזרת האפליקציה עצמה שמוצאת זמנים פנויים משותפים.\nבנוסף האפליקציה מתריעה על אירועים שעתידיים לקרות ומכילה בולטים קבועים אותם ניתן להוסיף ללוז, לדוגמא מבחן, חופשה, עבודה, אימון וכדומה.\n\nהיתרון של האפליקציה ומה היא באה לפתור: \nלאורך התואר נתקלנו בקשיים לקבוע פגישות לטובת פרויקטים שמובלים ע\"י שני אנשי צוות או יותר, על לכן החלטנו להקים את 'Kalena' שנועדה לעזור לסטודנטים עתידיים ולחסוך מהם מאמצים ומשאבים רבים לטובת קביעת פגישות משותפות. האלגוריתם שמאחורי הקלעים מבצע חיפוש חלונות זמן פנויים בלוחות שנה נבחרים,  אנו רואים בKalena - עזרה משמעותית לסטודנט, ערך מוסף שמתבטא בתכנון וניהול נכון של זמנים, ריכוזיות ושיתופיות.\n\nצד לקוח:\nReact ליצירת רכיבי UI ו Bootstrap לעיצובם.\nצד שרת:\nשפת התכנות בה השתמשנו היא  - FastAPI paython והשתמשנו ב MongoDB  כמסד הנתונים.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e483",
//     workshopId: "613ce0fd6b3ab6b59152e48a",
//     title: "Football Predictions",
//     imageSrc:
//       "https://static.wixstatic.com/media/0f500a_5ce46041c85244b2a00e8bd1426b68cb~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211202",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "לידור זומר נועם כהן אריה וורמן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קרקובסקי רועי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "ארכיטקטורות ביג דאטה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "Football Predictions הינה web &amp; mobile application שמטרתה לנבא תוצאות וסטטיסטיקות על משחקי כדורגל מהליגות הבכירות באירופה המבוססת על Machine Learning and Big Data.\nהאפליקציה שרצה בענן של Google Cloud מאפשרת למשתמש לבחור משחק כדורגל וקטגוריות נפוצות שעליהן רוצה המשתמש לקבל תחזית, לאחר מכן האפליקציה משתמשת במודלים של רשתות נוירונים ומודלים סטטיסטיים על מנת לספק את התחזית הרצויה על בסיס נתוני העבר שנאספו בבסיס הנתונים של המערכת. כמו כן המשתמש יוכל לצפות בתחזיות האחרונות שביצע בעמוד מיועד.\nטכנולוגיות וכלים:\nמקור מידע גולמי: RapidApi,\nבסיס נתונים: MongoDB,\nצד שרת: python flask,\nשירותי ענן: Google Cloud Platform,\nלמידת מכונה: pytorch &amp; pandas,\nצד לקוח: ReactJS &amp; React-native\nניהול גרסאות: Bitbucket.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e483",
//     workshopId: "613ce0fd6b3ab6b59152e48a",
//     title: "SafeTube",
//     imageSrc:
//       "https://static.wixstatic.com/media/a10a7f_670e6ddc424e4e93bd7d091456bc8072~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211204",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עדו קנדלר מעיין הדר מור כהן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קרקובסקי רועי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "ארכיטקטורות ביג דאטה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/maayanhd/SafeTube",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "כיום ילדים נחשפים לאינטרנט בגיל צעיר יותר מאי פעם. כידוע, האינטרנט' מתוקף היותו חופשי ונגיש לכל, מכיל תכנים רבים המועלים על ידי גורמים שונים ללא כל בקרה על אופיים ותוכנם טרם הועלו. השילוב בין הדברים הוא שמביא לכך שילדים בעת שיטוטם באינטרנט פוגשים תכנים שאינם הולמים לגילם ללא ידיעת ההורים (בין אם דרך הסמארטפון הפרטי או המחשב), בפרט כאשר מבלים את זמנם ב-YouTube (שכן מדובר בפלטפורמה הפופלארית ביותר לשיתוף סרטונים). \nמטרת הפרויקט שלנו היא הקמת פלטפורמה לצפייה בטוחה בסרטונים תוך סינון תוכן שלא הולם לילדים הכולל בין היתר קללות, אלימות, תכני מכירות המכוונים לילדים וכו'…\nהשימוש במוצר ייעשה על ידי הכנסת קישור לסרטון / פלייליסט מYoutube בידי הורה או אדם מבוגר, ובתמורה יוצג הסרטון באם מותאם לצפייה עבור ילדים לצד ציון המעיד על רמת תאימותו לילדים. במידה והוכנס פלייליסט יוצגו הסרטונים ה\"בטוחים לצפייה\" עבור ילדים באותו האופן, וכן תוצג הודעה אודות מספר הסרטונים שלא עמדו בסינון מסיבות אלו או אחרות. \n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e483",
//     workshopId: "613ce0fd6b3ab6b59152e48a",
//     title: "חדשות מקומיות",
//     imageSrc:
//       "https://static.wixstatic.com/media/f8ad47_0542acc597144988b6e971d88d246a9d~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211205",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "שמעון ארשבסקי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קרקובסקי רועי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "ארכיטקטורות ביג דאטה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/Shimon-ar/local_news",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "חדשות מקומיות הינו אתר חדשות שמאפשר למשתמשים לצפות בכתבות לפי אזורים, פרסום כתבות בזמן אמת, שמירת כתבות שהמשתמש אהב וכן צפייה בכתבות לפי קטגוריות שונות: ספורט, טכנולוגיה, כלכלה ועוד.\n\nבין יכולותיו של האתר הוא ניהול משתמשים, משתמשים רגילים ומשתמשים שמוגדרים כמנהלים בעלי היכולת לאשר או לדחות כתבות שפורסמו. לכל משתמש האפשרות לסמן כתבות שאהב וצפייה בסטטוס הכתבות שפרסם, בנוסף קיימת האפשרות למשתמש למחוק כתבה שפרסם.\n\nלחדשות מקומיות יש מערכת התראות שמעדכנת בזמן אמת את המשתמשים על אישור או דחיית הכתבות שפרסמו.\n\nפותח באמצעות React, Flask, MongoDB.\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e483",
//     workshopId: "613ce0fd6b3ab6b59152e48a",
//     title: "Tripi",
//     imageSrc:
//       "https://static.wixstatic.com/media/61ae29_c807aab0462147e6a9f322ec3a2e0ec2~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211207",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "גרי קוגן מישל ויצמן ירדן גור עידו עוזיאלי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קרקובסקי רועי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "ארכיטקטורות ביג דאטה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/garikf1h/Tripi.git",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'Tripi הינה Web Application אשר מנגישה מידע אודות טיולים ברחבי הארץ בהתאמה אישית לכולם.\nבמסגרת האתר, כל אחד יוכל להכניס את העדפותיו האישיות, כגון אזור בארץ, סוג טיול, תנאים מגבילים וכו, ובהתאם לכך המערכת תמליץ למשתמש על טיול אידיאלי בשבילו, הכולל:\n\n·         סיור באתר מוכר ברחבי הארץ\n\n·         ארוחה במסעדה\n\n·         מקום לינה\n\nבנוסף, יוכל הלקוח להרכיב מסלול בעצמו על ידי בחירת והתאמת כל "רכיב" טיול בעצמו.\n\nTripi למעשה מביאה נתונים ממאגרי מידע שונים (ביניהם מאגר הטיולים והאטרקציות של הרשות לתיירות) ומחברת ביניהם, ובכך מאפשרת לראות את הכל במסך אחד, על מפה אחת, ולתכנן את היום המושלם עבור כל אירוע.\n\nצד לקוח פותח בJavaScript, HTML וReact\nצד שרת פותח בשפת התכנות Python, עם התממשקות למאגר נתונים מתוך הרשות לתיירות.\nבנוסף יש שימוש בAPI של Google על מנת לשאוב נתונים על מקומות לינה ומסעדות וכן להשלים מידע על מסלולי הטיול.\nמסד הנתונים הינו MySql.\nחיבור בין צד שרת לצד לקוח נעשה בעזרת חבילת Flask',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e483",
//     workshopId: "613ce0fd6b3ab6b59152e48a",
//     title: "DriveAware",
//     imageSrc:
//       "https://static.wixstatic.com/media/ee249a_ea361349d0c34f1d9a2a831085bc72ba~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211206",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "יהלי יעקב יוני מלכי רבקה טובמן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קרקובסקי רועי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "ארכיטקטורות ביג דאטה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'מספר עצום של אנשים נוסעים בכביש המהיר ביום ובלילה. אנשים אלו, ביניהם נהגי אוטובוסים ונהגי מוניות, נוסעים למרחקים ארוכים בעודם סובלים ממחסור בשינה. עקב כך, ערנות הנהגים ירודה והנהיגה נעשית מסוכנת.\n\nמרבית התאונות מתרחשות עקב חוסר ערנות הנהג. בארצות הברית מדי שנה מדווחים למשטרה כ-100,000 תאונות דרכים בעקבות חוסר ערנות אצל נהגים. בעוד שבמחקר שנעשה ע"י ה-AAA Foundation נמצא כי 328,000 תאונות דרכים בשנה מתרחשות מהסיבה הנ"ל.\n\nלכן, בניסיון למנוע תאונות אלה בנינו מערכת לזיהוי ערנות אצל נהגים שתזהיר את הנהג כאשר הוא מרגיש ישנוני.\n\nהפרויקט כתוב בשפת Python ועושה שימוש ב:\n- Dataset פומבי של עיניים בשם MRL Eye Dataset, המכיל כ-84,000 תמונות עיניים של אנשים שונים, ממוינות ל-2 קטגוריות, פתוח וסגור.\n- ספריית קוד פתוח Keras עבור ML. ביצוע Supervised Learning בעזרת CNN על ה-Dataset תוך חלוקה ל-training data, validation data ו-test data כדי לפתור בעיית סיווג.\n- OpenCV עבור איסוף התמונות מהמצלמה ועיבודן.\n- Classifier מספריית Dlib אשר מזהה את הפרצוף והעיניים בתמונות במטרה לסווג את מצב עיני הנהג בעזרת המודל שבנינו.',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e483",
//     workshopId: "613ce0fd6b3ab6b59152e48a",
//     title: "FLIK ",
//     imageSrc:
//       "https://static.wixstatic.com/media/9b2790_64de3bd274f44ba68ed25576a2904a2e~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211203",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "יותם יצחק קים ששי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קרקובסקי רועי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "ארכיטקטורות ביג דאטה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'לאחר שנתקלנו בדילמה המורכבת ביותר ביום בחייו של סטודנט, עלה בראשנו רעיון שיספק מענה אטרקטיבי עבורה. הנה עוד יום לימודים מתיש ומייגע מגיע לסיומו וזה הזמן להתרווח על הספה ולשקוע אל מול הדמויות המרצדות על המסך. ואז עולה השאלה, "אבל באיזה סרט אבחר?" \nבידנו יש את הפתרון. \nFLIK - אפליקציה אשר מאפשרת למשתמש לייצר רשימת סרטים לצפייה. \n\nאז איך זה עובד? \n\nFLIK תציג למשתמש סרט מסוים ופרטים מקיפים אודותיו: קדימון (טריילר), ז\'אנר, שנה, אורך הסרט, במאי, צוות השחקנים, פרסים, דירוגים ועוד. המשתמש יבחר באחת מהאפשרויות הבאות:\n1. הזזה ימינה – צפיתי בסרט ואהבתי אותו!\n2. הזזה שמאלה – אין לי כל עניין בסרט זה. \n3. הזזה למעלה – אשמור את הסרט ברשימת הסרטים לצפייה.\n\nהידעת?\n\nFLIK מכילה מנוע המלצות מתקדם אשר ממומש באמצעות אלגוריתם של Machine Learning. אלגוריתם זה הנו למעשה שילוב של שני אלגוריתמים שונים: Content Based Recommendation וכן Collaborative Filtering. ה-data עבור מנוע זה מתבסס על היסטוריית ההזזות של המשתמש וכן על השחקנים ועל הסרטים אשר סימן כמועדפים עליו בעת ההרשמה ל-FLIK.\n\nהמימוש: \n\n•\tFront-end: React Native + Typescript\n•\tBack-end: Express + Typescript\n•\tDatabase: MongoDB\n•\tRecommendation system: Pandas, Sklearn, Numpy, Scipy + Python\n\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48b",
//     title: "CovidLife",
//     imageSrc:
//       "https://static.wixstatic.com/media/e1602c_986ce295065b483abb2d3f483c1725d4~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210601",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "רון הכרי אמיר רווח",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "הנדסת תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'Covid-life הינה אפליקציית web שנכתבה בעקבות וירוס הקורונה שתקף אותנו בשנה האחרונה.\nמטרת האפליקציה להראות למשתמש סימולציה על נתוני תחלואה שמתעדכנים בעקבות החלטות משתמש בנוגע לסגרים בערים שונות.\nאנו מאפשרים למשתמש להרגיש כיצד החלטות שונות יכולות להשפיע על מצב התחלואה, במודל של מעין "משחק" סימולציה.\nלמשתמש יש אפשרות להחליט האם לסגור ערים לפי מצב התחלואה בערים לפי הנתונים העדכניים.\nהטכנולוגיות שעשינו בהן שימוש: blazor (שרת לקוח בשפת C# שממיר מאחורי הקלעים קוד C# לקוד Javascript), קבצי html, וקבצי css.\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48b",
//     title: "EZHack",
//     imageSrc:
//       "https://static.wixstatic.com/media/ffa4c8_5f36ca8bfe8841bfb1e478d2ce28d0d6~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210605",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "ארנו מארק נדב סולימן דור לסרי שי רובינשטיין",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "הנדסת תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/SprintHack/ezhack",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "במהלך הקמת MTA Hack 2021, מקימי ההאקאתון מצאו את עצמם בבעיה כאשר היו צריכים להשתמש בכמה פלטפורמות שונות על מנת להקים ולנהל את ההאקאתון.\nולכן, החלטנו להקים את EZ Hack, מערכת המאגדת את כל השירותים הנדרשים להקמת האקאתון בצורה יעילה, קלה ומהירה.\nEZHack הינה open-source web-application המבוססת על Quill, מערכת הרישום הפופולרית של HackMIT, שגם היא open-source. חוץ מרישום, EZ Hack תספק מערכת ניקוד לשופטים, פורומים יעודיים לנושאים שונים, פרופילי משתמשים, ורישום למנטורים ושופטים.\nעבור המארגנים, EZHack מספקת  ready-to-use platform אשר מקלה על תהליך הקמת ההאקאתון. עבור המשתתפים, EZ Hack מספקת ממשק נקי ופשוט לרישום, דיונים בין מנטורים והצגת הפרויקטים שלהם.\nהטכנולוגיות בהן EZHack משתמשת הן AngularJS, MongoDB, Node.js.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48b",
//     title: "  Marshmallow",
//     imageSrc:
//       "https://static.wixstatic.com/media/77e0b0_1886f2f506c440748ebfd2b0ad4340a8~mv2.png/v1/fill/w_189,h_111,al_c,lg_1,q_85/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210606",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עמרי זוטא אורנה ליפקין",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "הנדסת תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'Marshmallow. managing your job hunt\n\nמרשמלו הוא אפליקציה web-ית שנועדה לנהל עבורך את תהליכי חיפוש העבודה שלך. מרשמלו עוזרת לך למצוא ביעילות ובאופן מאורגן את המשרה הבאה שלך, מבלי ללכת לאיבוד בקובץ excel מסורבל.\n\nעם הכניסה לחשבון האישי, מופיע dashboard המרכז באופן ברור מידע תמציתי לגבי כל אחד מתהליכי הקבלה לעבודה (application process, ובקיצור-תהליך). ה-dashboard מאפשר למשתמשת להסתכל קדימה, מה צפוי בתהליכים השונים וגם לקבל מידע על תהליכים מהעבר. ה-dashboard נותן מבט-על וממנו אפשר להיכנס לתצוגה מפורטת אודות תהליך ספציפי. ניתן למיין, לסנן ולחפש ב-dashboard. \n\nהמשתמשת יכולה לפתוח תהליך חדש או לעדכן תהליך קיים. בכל תהליך, ניתן לשמור פרטים אודות החברה, המשרה, אנשי קשר ולשמור בנפרד מידע לגבי כל אחד מהשלבים בתהליך: מהגשת קו"ח, דרך הראיונות השונים ועד להצעת העבודה.\n\nמידע על שלב בתהליך כולל, בין השאר, את סוג הפגישה, התרשמות של המשתמשת לאחר הפגישה ואת תאריך הפגישה, לרבות אפשרות לייצא פגישות ליומן.\n\nלמרשמלו יש גם chrome extension המאפשר למשתמשת לשמור מידע אודות משרה מסוימת, מאתר דרושים ישירות לתהליך במערכת. ',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48b",
//     title: "Drifter",
//     imageSrc:
//       "https://static.wixstatic.com/media/82f527_4a06e328bec245cf80df2bb2eb95dac3~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210602",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "חן שוסטר נועה גינזבורסקי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "הנדסת תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/noaginzbursky/drifter",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "תשתיות מחשוב משתנות כל הזמן. כדי לנהל אותן בצורה יעילה infrastructure as code (IaC) frameworks פותחו ותפסו תאוצה בתעשייה, כדוגמת Terraform ו Pulumi .\nצוותי התשתיות מנסים להימנע כמה שניתן מביצוע קונפיגורציות בצורה ידנית או שינוי ידני של משאבים המנוהלים בתשתית ה IaC .\n\nאך שינויים של הקונפיגורציות מחוץ לתשתית ה IaC של הארגון הם בלתי נמנעים. לדוגמה, צוותי SRE או support engineers שבניהול תקלות מבצעים שינויים ידניים ב console או cli . \u000bשינויים אלו נקראים Drift .\n\nDrifts יכולים לגרום לבעיות יציבות (קונפיגורציות שלא נבדקו), עלויות לא צפויות או להוות פערים ב Security או Compliance.\n&nbsp;\nDrifter, אפליקציית הweb אשר פיתחנו, עוזרת לארגונים לנהל שינויים הנעשים מחוץ ל IaC lifecycle של הארגון.\nהיא תציג את כלל הdrift-ים הקיימים בתשתית של הארגון ותאפשר למשתמשים לייבא או לתקן את הdrift-ים בקלות ובמהירות דרך המערכת.\n\n\n",
//       },
//     ],
//   },
//   {
//     status: "pendingTeacherApproval",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48b",
//     title: "SmartSend",
//     imageSrc:
//       "https://static.wixstatic.com/media/77673b_c2b4aeca19b642e2bdcf0e0b6d41c6f9~mv2.png/v1/fill/w_256,h_151,al_c,lg_1,q_85/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210603",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "ארז חסון ברק סגל מידן לוי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "הנדסת תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/erezhasson/SmartSend",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'כיום, ובעיקר בתקופת הקורונה והריחוק החברתי, ישנה תאוצה בשימוש בשליחויות ונוצר צורך לשליחים בכל תחומי ההפצה השונים. בעזרת SmartSend תוכלו לקחת חלק פעיל במערך ההפצה, להנות משירותי Tracking של החבילות שלכם והורדת עלויות במחירי המשלוח.\nכל אדם פרטי בעל רישיון נהיגה וכלי רכב (מכונית, אופנוע או כלי רכב חשמלי) מוזמן להצטרף למערך ההפצה ע"י הרשמה לשירותי SmartSend, וכבר במועד ההרשמה הוא מספק ימים ושעות בשבוע אשר נוחים לו לעבוד.\nSmartSend מאפשרת לחברת המשלוחים והן לשליח לחסוך במשאבים כגון זמן, כסף וכוח אדם וללקוח לצמצום בזמני ההפצה וקבלת חווית רכישה חיובית.\n \nטכנלוגיות:\nצד לקוח\nצד הלקוח מחולק ל-2 טכנולוגיות עיקריות:\n-         אתר המערכת: באתר מוצג מידע כללי על המערכת ומה שירותיה, תמיכה לשירותים שונים והרשמה כמשתמשים חדשים למערכת.\nכיצד מפותח?: האתר מפותח בשפות HTML, React, CSS.\n-         אפליקציה לנייד: משמשת לשליח אשר נמצא בשטח ומעוניין להשתתף בתהליך ההפצה של משלוחים שונים. באפשרותו לצפות במידע על משלוחים קיימים ופרטים בזמן אמת על משלוחים פעילים.\n-         האפליקציה משמש ללקוח ככלי מעקב אחר משלוחים שכבר נאספו.\nכיצד מפותח?: האפליקציה מפותחת בסביבת Android Studio ובשפות Java, Kotlin.\n\nצד שרת\nצד השרת מאופיין ע"י שימוש במסד נתונים על משלוחים וחברות ההפצה השונות.\nכיצד מפותח?: השרת מפותח בסביבת Firebase.\n\n',
//       },
//     ],
//   },
//   {
//     status: "pendingStudentsEdit",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48b",
//     title: "Final Projects Web App",
//     imageSrc:
//       "https://static.wixstatic.com/media/3f781c_6c4be5c657d045dba7af43c5120a4d4c~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210604",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "שגיב לוי דניאל כפיר",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "הנדסת תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/Danii1415/finalProject",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "אפליקציה זו מאפשרת לכל מרצה לנהל ולערוך את מערכת הגשת ועריכת הסדנאות השנתית בצורה נוחה ופשוטה למשתמש, תוך כדי יצירת קשר ועדכון התלמידים על שינויים שנעשו וסטטוס העבודה שלהם.\n\nתחילה המערכת תספק לכל מנחי הסדנאות שם משתמש וסיסמא ייחודית לכניסה למערכת. \nהסטודנטים בסדנה השייכת לכל מרצה יקבלו גם הם קישור לדף הגשת תקציר סדנה, התומך גם בטקסט בשפת MarkDown. לאחר הגשת הפרויקט נשלח מייל למרצה ולסטודנטים המודיע על הגשתו ומספק לינק ייחודי לדף עריכת הסדנה עם ה-ID שלה. בעמוד זה המרצה יכול לבחור לאשר את תקציר הסדנה, להחזיר שוב לעריכתה על ידי הסטודנטים עם הערה מתאימה או לערוך אותה בעצמו. כמו כן קיימת תמיכה במערכת הודעות בין התלמידים למרצה בתוך העמוד, כאשר כל שינוי בסטטוס הסדנה/הודעה שנשלחה יעדכן את המשתתפים והמרצה במייל גם כן. למרצה תינתן גישה לניהול כל הסדנאות שהוגשו לו, עם סינון של הסדנאות לבחירתו (סדנאות שאושרו או נשלחו לעריכה מחדש).\nלאחר אישור ההגשה, הסדנה תופיע בעמוד הסדנאות שאושרו אשר לבסוף ישמש כדף הצגת הסדנאות.\n\nטכנולוגיות בהן השתמשנו:\nצד הלקוח - React Js.\nצד השרת - Python (Flask).\nבסיס הנתונים - MongoDB.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e485",
//     workshopId: "613ce0fd6b3ab6b59152e48c",
//     title: "iWear",
//     imageSrc:
//       "https://static.wixstatic.com/media/2b7c48_908d3f14032642e1b94648cd1da35621~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210401",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עמית אהרוני שי לוי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר מרגלית דרור",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יזמות בפיתוח מוצרי תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/AmitAharoni/iWear2021",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'בעידן הנוכחי, העולם הופך "חכם" יותר, הטכנולוגיה מתקדמת ומתפשטת לכל התחומים, כולל תחום האופנה, אך ארון הבגדים, בו שימוש יום-יומי, נשאר מאחור.\niWear מכניסה את ארון הבגדים למרחב הדיגיטלי במטרה להפוך את ניהולו, ובחירת פריטי הלבוש, למתקדמים וחכמים יותר.\n\niWear עוקבת ומנתחת את השימוש בפריטי הלבוש, בעזרת שימוש בטכנולוגיית RFID, ומספקת נתונים וסטטיסטיקות בעזרתם המשתמש ינהל את ארון הבגדים בצורה חכמה, ויקבל המלצות לבחירת פריטי לבוש על פי פרמטרים שונים - קטגוריית לבוש, מזג אוויר, תדירות שימוש ועוד.\nהלקוחות הפוטנציאליים של iWear הם, מחד, כל בני האדם שקונים פריטי לבוש ומנהלים את ארון הבגדים, ומאידך, יצרני הביגוד המעוניינים ללמוד על השימוש השוטף בבגדים אותם הם מייצרים ומשווקים.\niWear הוקמה במטרה למצות את ההזדמנויות הטכנולוגיות בעידן הנוכחי ולייצר שוק חדש שישלב את תחום האופנה ביחד עם עולם הדאטה – במטרה לחולל מהפכה חכמה בתעשיית האופנה ובמיוחד בתחום ה-Fashion eCommerce.\n\nמערכת iWear הינה Web-app אשר פותחה בPython בעזרת Django תוך שימוש בטכנולוגיית RFID.\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48d",
//     title: "Office Manager",
//     imageSrc:
//       "https://static.wixstatic.com/media/da318b_46b598e5894b42ccaf17a0541ae0de20~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210901",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "נעמה כהן חן טבת",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יישומי רשת",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/naamaCohen1/officeManager.git",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "בשנים האחרונות, ובפרט עקב נגיף הקורונה, העבודה מהבית הפכה לחלק בלתי נפרד מהשגרה.\nאם בעבר ניהול המשרד והעובדים התבצע על ידי מגוון גורמים (מערכות נוכחות, משאבי אנוש ועוד), כיום, ניהול המשרד שינה את צורת העבודה והמחשבה וכל זה לא רלוונטי.\n\nOffice Manager הינו ממשק אינטרנטי פשוט ונוח לשימוש העובדים והמעסיקים שמרכז את כל הפעילויות הנ\"ל במקום אחד. \nהאתר מאפשר לעובדי החברה רישום הגעה למשרד, נוכחות במשרד (צפייה בעובדים הרשומים לתאריך מסוים), מילוי הצהרת בריאות ועוד.\nבנוסף לאפשרויות אלה ישנן אפשרויות נוספות הזמינות לדרג הניהולי בלבד, כגון – צפייה בסטטיסטיקות (דוחות הגעה בשבוע/בחודש האחרון לפי קטגוריות שונות), ניהול העובדים (הוספה, עריכה ומחיקת עובדים) וכו'.\n\nOffice Manager מביאה צדדים נוספים לצד הניהול השוטף של החברה, מקלה על משאבי האנוש ומעניקה כלים לביצוע צעדים למען החברה וייעולה. \n\nכלים וטכנולוגיות פיתוח – C#, ReactJS , SQL-Server, Rest-API. נתמך בדפדפן Chrome.\n",
//       },
//     ],
//   },
//   {
//     status: "pendingTeacherApproval",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48d",
//     title: "NBA Fantasy League",
//     imageSrc:
//       "https://static.wixstatic.com/media/eaa506_49dc7fa31bcd4c9d82938cce916a381f~mv2.png/v1/fill/w_39,h_23,al_c,lg_1,q_85/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210902",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "דור שראל עומרי שלו נתנאל קורן יודי יהודה",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יישומי רשת",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value:
//           "https://github.com/DorSarel/Fantasy-client;https://github.com/Yudiye/NBAFantasyPro",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "NBA Fantasy League, ז'אנר המאפשר לחובבי ספורט בכל רחבי העולם לנהל ליגה משלהם הכוללת קבוצות, רכש של שחקנים, ניתוח סטטיסטיקות וכו' תוך כדי קבלת עדכונים באופן שוטף לאורך העונה הסדורה.\n\nכיום קיים מוצר של ESPN המאפשר את חווית הFantasy בצורה רחוקה מלהיות אופטימלית, טכנולוגיות מיושנות, פיצ'רים לא רלוונטים היוצרים חווית משתמש מורכבת, איטיות ועוד בעיות שגרמו לנו להבין שצריך שחקן חדש בעיר.\n\nבעזרת פלטפורמה מבוססת web, הצלחנו לייצר מערכת יעודית שתקל על חווית המשתמש, תזקק את הפיצ'רים העיקריים והחשובים לשחקנים ותאפשר לנו ולבאים אחרינו להינות מהFantasy League.\n\nהטכנלוגיה כוללת: ממשק UI שפותח בReact + Redux, מערכת backend מבוססת .Net 5 עם מנועי חיפוש מתוחכמים כגון: Elastic Search וPostgreSQL. הכל במטרה לייצר נוחות ומהירות כמו שמגיע למשתמשים.",
//       },
//     ],
//   },
//   {
//     status: "pendingStudentsEdit",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48d",
//     title: "Juntos",
//     imageSrc:
//       "https://static.wixstatic.com/media/33428b_55b6276a010b4d5fa28028c9fc5e4171~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210903",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "אחינועם טיירי גבי וייס",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יישומי רשת",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/ahinoamta/Juntos",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'Juntos היא אפליקציה לנייד המאפשרת קבלת התרעות פיקוד העורף בזמן אמת, הצגתן למשתמש והמלצת פיקוד העורף על דרך פעולה בהתאם לפרופיל המשתמש ומיקומו הנוכחי.\nהמשתמש מתבקש להזין פרטים אודותיו על מנת שהאפליקציה תמליץ עבורו על דרך הפעולה הרלוונטית אליו בהתאם למצבו הנוכחי כגון: ניווט למקלט ציבורי קרוב, הגעה לממ"ד, יציאה לחדר המדרגות וכיוצא בזה.\nבשונה מאפליקציות קיימות בשוק, האפליקציה מתאימה את עצמה למשתמש בהתאם לגילו, מיקומו הנוכחי והאם יש ברשותו ממ"ד.\nהאפליקציה תומכת ב API של פיקוד העורף וכרגע נמצאת בשלבי POC. בנוסף, המידע הגולמי אודות מקלטים ציבוריים נלקח מעיריית תל אביב יפו. \nטכנולוגיות פיתוח: React Native, Python, Firebase.\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48d",
//     title: "Get Pet",
//     imageSrc:
//       "https://static.wixstatic.com/media/3e880d_6a175be3b2044ea082ef2c70230a14d9~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210904",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "הדר לוי ליזה לכטמן שרון אדרי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יישומי רשת",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/Hadarlevi05/GetPetProject",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'כיום כל אדם המעוניין לאמץ בע״ח צריך לעבור בין אינספור אתרי עמותות המציגים בעלי חיים לאימוץ, כאשר ברוב האתרים אין יכולת סינון מתוחכמת פרט למין בעל החיים וכמות בעלי החיים הינה מצומצמת ביותר בכל עמותה.\nGetPet הינו אתר אינטרנט המרכז בעלי חיים ממגוון אתרי עמותות במקום אחד, ומציע חווית משתמש נוחה ופשוטה המייעלת את תהליך אימוץ בעלי החיים. מעבר למאגר של בעלי חיים מעמותות שונות, האתר מאפשר סינון חכם ואחיד של תכונות בע"ח, אשר נאספו מתיאורי בעלי החיים באתרי העמותות. בנוסף, ישנו מנגנון התראות המודיע למשתמש שנמצא בעל חיים עם התכונות הרצויות שהוא הזין במערכת, וישנה אפשרות להעלות בע"ח לאימוץ באופן פרטי עבור משתמשים הרשומים למערכת ובכך נחסך הצורך לעבור דרך עמותה מסוימת.',
//       },
//     ],
//   },
//   {
//     status: "pendingTeacherApproval",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48d",
//     title: "מֶש - מבשלים עם מה שיש",
//     imageSrc:
//       "https://static.wixstatic.com/media/dd799b_fb1c74d623b140a1ba5317931290bea4~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210905",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "דור פיזם ערן שמואל נתנאל ירושלמי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יישומי רשת",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "מֶש הינו אתר מתכונים אינטרנטי ייחודי הכולל שלל מתכונים במגוון קטגוריות.\nהאתר מציע למשתמשים לבחור מתכונים על פי המצרכים שיש להם בבית. כל משתמש יזין בכניסה לאתר את המצרכים שיש לו בבית ו/או במקרר ובכך יותאמו לו מתכונים בהתאם, ללא צורך לצאת מהבית לקניות.\n\nמֶש משמש כמנוע חיפוש חכם, הפועל באמצעות סריקה אוטומטית של אתרי בישול, שמירת הרכיבים המתאימים, מידע נלווה ואופן הכנה בטבלת נתונים.\nכל משתמש יכול להזין במעמד החיפוש העדפות קולינריות שונות (כשרות, רגישויות וכו'). מנוע החיפוש יתחשב בהן בעת איתור המתכונים. \n\n",
//       },
//     ],
//   },
//   {
//     status: "pendingStudentsEdit",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48d",
//     title: "Algros",
//     imageSrc:
//       "https://static.wixstatic.com/media/c87218_c5881442825c4efd84f7f3048cd5f64f~mv2.jpg/v1/fill/w_214,h_126,al_c,lg_1,q_80/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210912",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "מור שאול אלכס לפונדה",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "אמיר קירש",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יישומי רשת",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'מערכת Algors הינה Web Application אשר מרכזת שאלות בעלי תכנים רלוונטים לצורך למידה והעמקה לקראת ראיונות עבודה בתחום הפיתוח.\nהמערכת נועדה לסטודנטים ובוגרים בתחום ותפקידה לסייע במוכנות לקראת ראיונות העבודה.\nהמשתמשים באפליקציה נרשמים למערכת ומקבלים תמונת מצב על היכולות שלהם במגוון תחומים ע"י פתירת תרגילים בהתאם לרמת הקורס שהם נמצאים בו.\nכל קורס מכיל מספר נושאים באותה רמת קושי, ככל שמתקדמים בקורסים רמת הקושי עולה בנושאים אלו וכך המשתמשים מקבלים תמונת מצב לגבי היכולות שלהם.\nבמידה והמשתמש ימשיך לקורסים ברמת קושי גבוהה יותר, כך הוא יוכל להשתפר בנושא ולנצל את הזמן ביעילות.\n\nבדף השאלה המשתמש יוכל לבחור שפת תכנות בה הוא מעוניין לפתור את השאלה. ישנם מספר אפשרויות של שפות כמו: java, c#, python וכו\'.\nלאחר הזנת התשובה המשתמש יקבל הודעה מתאימה, במידה והקוד לא התקמפל המשתמש יקבל הודעת שגיאה עם פירוט היכן השגיאה, במידה והקוד מתקמפל ירוצו מספר טסטים שיבדקו את איכות התשובה, אם כל הטסטים יעברו בהצלחה המשתמש יוכל להמשיך לשאלה הבאה באותו קורס אחרת יקבל הודעה שהטסטים נכשלו.\nבנוסף המשתמשים יוכלו גם להתייעץ וללמוד דרך פורום לכל שאלה.\n\nרכיבי הפרוייקט:\n\nFRONT-END\nה-front end בנוי כאתר רספונסיבי מבוסס react.\n\nBACK-END\nRest API כתוב ברובו ב-java, בתוספת שני קבצים שכתובים ב-python וב-batch.\nקיים שרת שמאזין ל-front end ושומר על כל המידע ב-database חיצוני (משתמשים, פורומים, שאלות וכו\').\nלצורך פעולת הקימפול של התשובות, הממשק פונה ל-API חיצוני. בנוסף אנחנו מחצינים את ה-API של ה-back end שלנו באמצעות swagger.\n\nDATABASE\nMySQL - מסד נתונים שמכיל את כל הטבלאות והמידע (משתמשים, שאלות, פורומים ועוד).\n\nCOMPILER AND RUNNER – API\nהתחברנו ל-API חיצוני שיודע לקמפל ולהריץ לפי input שנשלח אליו:\n<a data-auto-recognition="true" href="https://docs.jdoodle.com/compiler-api/compiler-api#java-example-for-execute-api-call" target="_blank">https://docs.jdoodle.com/compiler-api/compiler-api#java-example-for-execute-api-call</a>\n\n',
//       },
//     ],
//   },
//   {
//     status: "pendingTeacherApproval",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48e",
//     title: "Bubble",
//     imageSrc:
//       "https://static.wixstatic.com/media/9c7e1c_b02cb1b3c9364ea5bafcdc20499113bd~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210201",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "אוריום סמולש נוף חזז ליטל דורון",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יצירת מוצר תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'ריף הדולפינים באילת הינו אתר ייחודי מסוגו בארץ ובעולם המאפשר פגישה מקרוב עם דולפינים בבית גידולם הטבעי. הפעילות המרכזית של הריף היא מועדון הצלילה. כיום, ניהול ותפעול האופרציה השוטפת של אנשי הצוות אל מול הפעילויות היום יומיות שהמועדון מציע מתנהל באופן ידני ועל כן קיימות מגוון בעיות המתרחשות בעקבות עומס העבודה.\n\nהמערכת Bubble מטיבה עם אופי עבודתם של עובדי המועדון. המערכת מנהלת תהליכים ונותנת מענה לסוגים שונים של עובדים.\n\nלמערכת מגוון יכולות כגון שיבוץ אופטימלי של פעילויות הצלילה ע"פ אילוצים ונהלים, ניהול רווחה ומשאבי אנוש, ניהול והשכרת ציוד לוגיסטי, אספקת נתונים לצרכים עסקיים ועוד.\n\nהטמעת הפרויקט תייעל את תהליך קבלת הקהל של עובדי הדלפק ותחסוך זמן עבודה מהותי ע"י היכולת לקבל החלטות מבוססות מידע, אשר מטיבות עם חווית לקוח הקצה.\n\nהמערכת הינה מערכת web, אשר בנויה ב .NET Core 5.0 -, פיתוח צד שרת ב-C# וצד לקוח ב- C# ו-JavaScript. מסד הנתונים בנוי באמצעות  MS SQL. המערכת מאוחסנת ב- Microsoft Azure Cloud.',
//       },
//     ],
//   },
//   {
//     status: "pendingTeacherApproval",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48e",
//     title: "Givit",
//     imageSrc:
//       "https://static.wixstatic.com/media/5923ed_5ef13e2c2cd240a8b5b4fa96d80d85a8~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210202",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עמרי קולברג גל קולברג שלומי אליהו",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יצירת מוצר תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/OmriColberg/GivitApp",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "הסדנה שלנו עוסקת בפיתוח אפליקציה שתשמש כפלטפורמה לארגון ללא מטרות רווח בשם Givit.\nארגון Givit אחראי על השגת ציוד, איסופו והובלתו לבתי סטודנטים הזקוקים לו. \nהארגון שם דגש על פעילות אנונימית ונעזר במערך מתנדבים אשר עוזרים בתהליכי חיפוש המוצרים ואף מסייעים בהובלות. \nכאשר פעילות הארגון עלתה, עלה צורך בפלטפורמה נוחה ומתאימה אשר תשמש את הארגון וכך נוצר רעיון הסדנה שלנו. \nכרגע האפליקציה מאפשרת מעבר מידע שוטף הכולל רישום והתחברות משתמשים משני סוגים – מנהל ומשתמש רגיל : \nבפני המשתמש הרגיל עומדות מספר אפשרויות פעולה : \n•\tלהירשם לחיפוש מוצר מתוך רשימת מוצרים. כמו כן ביכולתו לבטל את ההרשמה\n•\tלעדכן את פרטי המוצר והמוסר שלו לאחר שנמצא המוצר הנדרש\n•\tלהירשם להובלות עתידיות. כמו כן ביכולתו לבטל את ההרשמה\n•\tלערוך את פרטיו האישיים באפליקציה \n•\tלראות תמונות של הובלות עבר\nבפני מנהל עומדות האפשרויות הבאות : \n•\tאפשרויות דומות למשתמש הרגיל \n•\tלהוסיף מוצר שנדרש לחיפוש \n•\tלהוסיף הובלה שאליה דרושים מתנדבים \n•\tלצרף להובלה את כל המוצרים הזמינים במערכת\nלצורך Frontend אנו משתמשים בפלטפורמת Flutter של Google בשפת Dart. \nלצורך Backend ו-Database אנו משתמשים ב-Firebase.\n",
//       },
//     ],
//   },
//   {
//     status: "pendingStudentsEdit",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48e",
//     title: "A&GBusinessesPromotions",
//     imageSrc:
//       "https://static.wixstatic.com/media/511610_9abcd06d5dc542a8a4be66b370e959a9~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210203",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "אביב זפרני גדעון שחר",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יצירת מוצר תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/avivz450/A-GBusinessesPromotions",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "A&amp;GBusinessesPromotions הינה אפליקציית ווב שהמטרה שלה היא פרסום עסקים הקשורים\nלקהילה מסוימת , ומידע רלוונטי נוסף לאותם עסקים, בצורה דינמית ומותאמת אישית לאותה הקהילה.\nפרסום זה יבוא לידי ביטוי ביצירת אתר בפלטפורמה שלנו, ע\"י מנהלי אתרי הקהילות, ובו יפורסמו\nהעסקים המתאימים .\n\nיהיו לנו שלושה סוגי משתמשים :\n1. אורחים: יוכלו לגלוש באתרים השונים בפלטפורמה שלנו, בהתאם לקהילה שיש להם עניין בה,\nולקבל סוגים שונים של מידע על העסקים בהם.\n2. בעלי עסקים/חנויות: יוכלו לפרסם ולערוך את העסקים שלהם, ומידע נוסף הקשור להם, בכל אתרי\nהקהילות בהם העסק מפורסם.\n3. מנהלי אתרי קהילות: תפקידם יהיה לנהל ולפקח על האתר המאגד בתוכו עסקים הקשורים\nלקהילה שלהם – משלבי היצירה ועד שלבי הניהול השותף.\n\nאת האפליקציה אנחנו מאחסנים בשרתי AWS ,ובנוסף השתמשנו בשירותים הבאים שהוא מאפשר לנו EC2, Route 53.\nהדומיין הינו : AGBusinessesPromotions.com.\n\nהטכנולוגיות בהן השתמשנו :\nצד הלקוח – HTML, CSS, JS\nצד השרת - Python, Django\nSQLite (ORM)– Database\nGoogle – API's\nGit and GitHub - SCM\nTesting - Pytest",
//       },
//     ],
//   },
//   {
//     status: "pendingTeacherApproval",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48e",
//     title: "DineWithMe",
//     imageSrc:
//       "https://static.wixstatic.com/media/c7350c_b46e3d3129084d97be55283d2f7a72ce~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210204",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "שני יעקובוביץ' שאיין דור עמית אלקובי רזיאל שרעבי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יצירת מוצר תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'ישראלים ידועים באהבתם לארח את הקרובים עליהם ואירוח כולל, איך לא? אוכל! אירועים אלו כרוכים בתהליך מבולגן שבו כל מוזמן מקבל לידיו אחריות של הכנת מנה כאשר המארח אחראי להחליט על סגנון הארוחה, להתחשב ברצונות וברגישויות כלל המוזמנים, שכל מוזמן מעוניין להכין את המנה שניתנה לו וכדומה.\n\n"DineWithMe" הוא אתר שנועד להקל על המארח בתהליך ארגון הארוחה. במסגרת תהליך יצירת ארוחה, המארח בוחר תחילה את סגנון הארוחה בו הוא מעוניין, ולאחר מכן מרוכזים לפניו מתכונים מאתרים פופולריים ברחבי הרשת. ניתן לסנן מתכונים ולהציג את אלה המתאימים לסגנון הארוחה, לרגישויות האורחים ולהעדפותיהם. המארח מוסיף לארוחה מתכונים לפי בחירתו ומקצה עבור כל מתכון משתתף שיהיה אחראי להכינו. כל משתתף מקבל את המתכון שעליו להכין ותהליך ארגון הארוחה נהיה פשוט, מסודר וכיפי.\nאז את מי אתם מזמינים?\n\nהפרויקט כתוב בשפת Python ומבוסס על Django framework. מאגר המתכונים נאסף מאתרים ברשת בעזרת crawler חכם שנכתב בשפתPython  ולאחר מכן המידע נשמר ב-sqliteDB.',
//       },
//     ],
//   },
//   {
//     status: "pendingTeacherApproval",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48e",
//     title: "Simon say's",
//     imageSrc:
//       "https://static.wixstatic.com/media/eaef05_ff10fd8c21164310ba4353126ff41932~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210209",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "דרור רבינוביץ' רועי ויסברגר ניר חכם אופיר לביא",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יצירת מוצר תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'משבר הקורונה אילץ אותנו להסתגר בבתים,שינה את צורת חיינו והכיר לעולם את אפליקציית ZOOM.\nאחת מתופעות הלוואי של הקורונה היה הצורך להעסיק את הילדים בבית עקב חוסר היכולת לשלוח אותם לבתי הספר ולחוגים, ולמעשה לספק להם תעסוקה בבית.\nבעקבות כך החלטנו לגייס כלים טכנולוגיים מתקדמים ולהתבסס על פלטפורמה זו על מנת לענות על צורך זה.\n\n"Simon Says" הוא משחק אינטראקטיבי המיועד לילדים ובני נוער אשר משלב יכולת ניתוח תמונה אשר קובע האם המשתתפים הצליחו לבצע את המשימה אשר הטיל עליהם Simon (אחד המשתתפים אשר הוגדר כמנהל) בהצלחה.\nהמשחק כעת מתבסס ורץ במקביל לאפליקציית Zoom ויודע לגזור מהאפליקציה את תמונות המשתתפים, לנתח אותן ולקבוע בהתאם להן האם המשתתף הצליח במשימה או לא.\nבהמשך המשחק יוכל להשתלב בפלטפורמות נוספות אשר דומות לZoom כגון:\nVonage, Google Meet, Daily, BlueJeans, Microsoft Teams וכו\'.\n\n\nהפרויקט פותח בצד השרת בשפת Python ומבוסס על טכנולוגיית Lobe שהיא טכנולוגיית\nMachine Learning של Microsoft לצורך עיבוד וניתוח התמונה.\nצד הלקוח פותח גם כן בשפת Python בסביבת PyCharm.',
//       },
//     ],
//   },
//   {
//     status: "pendingStudentsEdit",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48e",
//     title: "Easybot",
//     imageSrc:
//       "https://static.wixstatic.com/media/0bc73f_eb551067439e4ae79ddf1a50e5c3e949~mv2.png/v1/fill/w_274,h_161,al_c,lg_1,q_85/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210207",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "ארטיום קוזנצוב דניאל שאנן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יצירת מוצר תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/dannysheyn/bonter",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "\nEasybot הינה פלטפורמה ליצירת בוטים מורכבים לעסקים ולאנשים פרטיים.\nמטרת הפרויקט היא הנגשת תהליך יצירת בוטים ללא ידע קודם בקידוד. בעזרת ממשק משתמש נוח ופשוט שבו המשתמש יוצר תרשים זרימה של שיחה בין לקוח הקצה לבין הבוט.\nתרשים הזרימה נוצר באמצעות חיבור של אלמנטי שיחה עם חיצים על פי עיצוב המשתמש. תזרים זה יקבע את מהלך השיחה בין משתמש הקצה לבוט. המשתמש יכול ליצור אלמנטי שיחה שונים כגון: \n•\tשאלות למשתמש הקצה, ולפי התשובות הניתנות לבחירה לבחור לאיזה כיוון לקדם את השיחה.\n•\tשליפת נתונים בעזרת API, ופירמוט תוצאת הAPI באופן שיהיה נגיש למשתמש הקצה.\n•\tשליחת הודעה עם תזמון קבוע מראש.\n•\tקבלת קלט ממשתמש הקצה ובשימוש בערך זה בבניית הבוט.\n•\tניתן לשלב מספר אלמטים על מנת לקבל שיחה מורכבת ועשירה ככל שמהמשתמש רוצה.\nלאחר בניית הבוט, יהיה ניתן להפיץ אותו למשתמשי הקצה ובכל רגע יהיה ניתן לערוך ולשנות אותו. בנוסף כל משתמש יכול לבנות מספר בוטים  ולנהל אותם דרך הפלטפורמה. כל משתמש יוכל לבקש לצפות בשיחות הבוטים עם המשתמשים ובכך לראות כיצד ניתן או צריך להרחיב את הבוט. \nבוטים לדוגמה: בוט שמודיע על שינויים במטבעות מסויימים לפי בחירה, בוט שירות לקוחות.\n\nהפרויקט משלב צד לקוח וצד שרת אשר מומשו בטכנולוגיות הבאות:\nצד הלקוח -Telegram UI.\nצד השרת - Python.\nבסיס הנתונים - MongoDB.\n",
//       },
//     ],
//   },
//   {
//     status: "pendingTeacherApproval",
//     teacherId: "613ce0fd6b3ab6b59152e484",
//     workshopId: "613ce0fd6b3ab6b59152e48e",
//     title: "Tawseel",
//     imageSrc:
//       "https://static.wixstatic.com/media/6b1ea4_f70bc93decc44e4ab97310883310a673~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210208",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "אחמד סלאמה עוביידה כתה",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר קירש אמיר",
//         value: ":שם המנחה",
//       },
//       {
//         key: "יצירת מוצר תוכנה",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/Tawseel",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           " Tawseel היא פלטפורמה שנועדה להקל ולזרז את הדרך שבה נהגנו להזמין אוכל.\nTawseel חוסכת זמן למסעדות וגם ללקוחות.\n\nאפליקציה למסעדות:\nעם הכניסה לחשבון האישי, מופיע dashboard שמאפשר למסעדה להוסיף את המוצרים שלה וגם להוסיף לכל מוצר את הרכיבים שמרכיבים אותו.\n\nאפליקציה ללקוחות:\nעם הכניסה לחשבון האישי, מופיע dashboard שמאפשר ללקוח להזמין אוכל, לקוח בוחר מנה ואז בוחר את הקונפיגורציה הרצויה ולאחר לחיצה על כפתור התשלום הוא משלם ואז נשלח בון שמופיע באפליקציה של המסעדה והם מתחילים בהכנה.\n\nאפליקציה לשליחים:\nעם הכניסה לחשבון האישי, מופיע dashboard שמאפשר לשליח לקבל הזמנות ולשלוח אותם.\n\nTawseel ממומשת בטכנולוגיות המתקדמות ביותר:\n1- Spring boot\n2- React\n3- Swift UI\n4- AWS",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e487",
//     workshopId: "613ce0fd6b3ab6b59152e48f",
//     title: "ZuZu",
//     imageSrc:
//       "https://static.wixstatic.com/media/a0f1c3_cb30f8d1cc664d138052280d2ce38065~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210801",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עודד זקן נסי לרוס",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גלובוס אורי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "מישחקים למידה ואפליקציות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/odedZaken/zuzu",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "ZuZu היא אפליקציה חברתית למציאת שותפים לפעילויות ספורט. האפליקציה עוזרת לארגן, לאתר ולהצטרף לאירועי ספורט קבוצתיים. ככה קל לארגן ולהצטרף למשל לקבוצות ריצה, רכיבה או משחקי כדור למיניהם. \nהמשתמש יכול לראות בזמן אמת את האירועים שנמצאים בסביבתו הגיאוגרפית בעזרת מפה אינטראקטיבית ולסנן את התוצאות גם לפי זמנים שנוחים עבורו. כאשר המשתמש מוצא אירוע שמעניין אותו הוא יכול להצטרף לקבוצה, לצפות בפרופילים של שאר המשתתפים ולצ'וטט איתם עוד לפני האירוע.\nהמשתמש יכול ליצור בקלות אירוע חדש ולהזמין את חבריו או משתמשים נוספים באפליקציה. החזון שלנו הוא לחבר אנשים תוך הנאה ספורטיבית ושמירה על אורח חיים בריא.\nבשלב זה האפליקציה פועלת רק במכשירי אנדרואיד. היא נכתבה ב Java כשהאינטראקציה ב Real Time מתאפשרת על גבי Firebase. האפליקציה עושה שימוש גם ב Google maps API, static maps API. את העיצוב עשינו בעזרת Glide וע\"פ עקרונות Material Design.\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e487",
//     workshopId: "613ce0fd6b3ab6b59152e48f",
//     title: "Plant Advisor",
//     imageSrc:
//       "https://static.wixstatic.com/media/08850d_60c3d067610245e894c5675ff6f86519~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210802",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "מקסים לובוביץ' תומר יקובוב",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גלובוס אורי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "מישחקים למידה ואפליקציות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "לאנשים שרוצים להתחיל לגדל צמחים בסביבה עירונית צפויה חוויה לא קלה. התנאים לגידול צמחים בבית אינם דומים לתנאים במשתלה וחסר להם ידע בכל הנוגע לגידול צמחים.  כשהצמחים מגיעים הביתה מהמשתלה חלק גדול מהם אינו שורד בגלל תנאים סביבתיים שונים כגון יותר מדי או פחות מדי אור וכן עקב טיפול לקוי כגון השקיית יתר. \n\nאפליקציית PlantAdvisor מאפשרת חוויה אידאלית של גידול צמחים בסביבה עירונית. האפליקציה עוזרת למצוא את הצמחים המושלמים למיקומים השונים בבית. באמצעות מענה על שאלון קצר ואיסוף נתונים עם חיישני הטלפון (מדידת אור למשל) האפליקציה יודעת להציע רשימה ויזואלית של צמחים שמתאימים בדיוק למקום הגידול הספציפי בבית. \nברגע שנבחר צמח מרשימת התמונות האפליקציה יודעת להציע רשימת משתלות שמחזיקות את הצמח הספציפי וממוינות לפי מרחק מהבית ודירוג לקוחות. לכל משתלה יש פרטים על המפה כולל אפשרויות ניווט וכן קישור למרכז הזמנות ככה שאפשר להתחיל לגדל בעזרת האפליקציה גם מבלי לצאת מהבית.  \n \nהאפליקציה נבנתה ב React-Native ,שרת NodeJS ומסד נתונים MySql שרצים על גבי הענן של AWS. האפליקציה מתממשקת כבר עם Waze, Google Cloud ועם Open Weather Map.\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e487",
//     workshopId: "613ce0fd6b3ab6b59152e48f",
//     title: "Data Playground",
//     imageSrc:
//       "https://static.wixstatic.com/media/a7f0bc_c7e2848effe642808bfa9333e0046527~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210803",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "ליאור צח אלון אגם אסתר ויג",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גלובוס אורי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "מישחקים למידה ואפליקציות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/wildlyclassyprince/data-playground",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'Data Playground היא פלטפורמה לפיתוח אוריינות נתונים עבור ילדים החל מגיל חטיבת הביניים. הפלטפורמה הינה יוזמה של MindCET האקסלרטור לטכנולוגיות למידה והוראה מבית מט"ח.\nב Data Playground ילדים יכולים לחקור נושאים שקרובים לליבם על ידי חקירה ויזואלית באמצעות גרפים מגוונים ואינטראקטיביים ודרך מיקוד בפרמטרים שמעניינים אותם. \nכיוון שרצינו לתרום לחינוך ובפרט לאוריינות מדעית היקרה לליבנו התלהבנו מהאפשרות לתרום את מאמצי הפיתוח שלנו לטובת הפרויקט ובינתיים הספקנו להוסיף מספר פיצ\'רים ולשפר את הנראות של מספר גרפים וכן את עדכון בסיס הנתונים.\nניתן לשחק באתר בכתובת : <a data-auto-recognition="true" href="https://data-playground.mindcet.org/" target="_blank">https://data-playground.mindcet.org/</a>\nהוא בנוי ב React.\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e487",
//     workshopId: "613ce0fd6b3ab6b59152e48f",
//     title: "Place-It",
//     imageSrc:
//       "https://static.wixstatic.com/media/e89bd9_67773ec1fc7c48e88cbbc7ee864a07d2~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210804",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "תום ויינברג דניאל בביצקי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גלובוס אורי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "מישחקים למידה ואפליקציות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "Place-It הוא משחק חשיבה המחדד את התפיסה המרחבית. המשחק שפיתחנו הוא גרסת מחשב למשחק קופסה שהומצא על ידי איתי סתת. המשחק מאפשר משחק יחיד או בזוג לשחקנים מגיל 7-99. \nPlace-It הוא פאזל תלת ממדי המורכב מחלקים צבעוניים בצורת האות ח' שאת הסידור המרחבי שלהם צריך לגלות. כשיש שני שחקנים כל אחד מהם מקבל רק מבט מצד אחד על הצורה המבוקשת ותוך כדי תקשורת ושימוש בדמיון מרחבי על השחקנים לגלות ולהרכיב ביחד את המבנה המרחבי המבוקש. \nכבר בתחילת המשחק נדרשת יכולת להיכנס לנעליו של האחר ולדמיין כיצד הדברים נראים מזווית אחרת. ככל שמתקדמים בשלבים, רמת הקושי והתחכום עולים.\nהמשחק פותח בשלב הראשון עבור   PC תוך שימוש במנוע התלת מימד Unity 3D ובשפת C#.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e487",
//     workshopId: "613ce0fd6b3ab6b59152e48f",
//     title: "clubdo",
//     imageSrc:
//       "https://static.wixstatic.com/media/7a1432_5e3601b0e1964c6b93e3f60c78e41532~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210805",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "דניאל קלמיקוב רון קויפמן יובל רז ליאור חן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גלובוס אורי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "מישחקים למידה ואפליקציות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "clubdo היא מערכת SaaS לניהול מועדוני אומניות לחימה. המערכת פותחה בשיתוף מספר בעלי מועדונים ועל בסיס ניתוח של יתרונות וחסרונות של מערכות ניהול מתחרות.\n\nהמערכות הקיימות סובלות מחסרונות רבים דווקא בפיצ'רים החשובים ביותר לבעלי המועדונים בארץ ובראשם: תמיכה בעברית, רישום נוכחות מקוון וקל גם דרך מכשירים ניידים וגישת משתמשים מגוונים דרך הענן.\n\nל-clubdo שלושה סוגי משתמשים בעלי צרכים וממשקים שונים:\nאנשי הנהלה – זקוקים לנקודת גישה אחת לניהול קל של כל היבטי המועדון המקצועיים\nוהעסקיים. כולל ניהול ומעקב לקוחות, ניהול פעילויות וניהול פיננסי.\nמאמנים – זקוקים לניהול בעיקר דרך מכשירים ניידים שכולל: מעקב נוכחות, ניהול מבחנים, מעקב אחר ההתפתחות המקצועית של ספורטאי, רישום למועדון, מעקב תשלומים וכו'.\nמתאמנים – זקוקים לגישה מכל מקום למידע על פעילויות ומעקב אישי על התקדמותם.\n\nclubdo עובדת עם כל מכשיר עם גישה לאינטרנט כולל IOS, Android, PC, MAC.\nהמערכת תומכת בעברית ובאנגלית ומסוגלת לתמוך בכל שפה נוספת בהתאם לרצון הלקוח.\n\nclubdo מורכבת משרת Node.js ובסיס נתונים NoSQL היושבים על גבי Firebase.\nאפליקציית Web ב-React.js ואפליקציית מובייל ב-React Native.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e487",
//     workshopId: "613ce0fd6b3ab6b59152e48f",
//     title: "ClassBook - שיתוף חומרי לימוד",
//     imageSrc:
//       "https://static.wixstatic.com/media/b3f40f_3b214439636a4614bd46e8250b89ad98~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210806",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "לאון רבינוביץ אלעד נוי ניר כהן רון זורנו",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גלובוס אורי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "מישחקים למידה ואפליקציות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "ClassBook היא הדרך החדשה לשיתוף חומרי לימוד עבור סטודנטים. כיום שיתוף חומרי לימוד נעשה תוך כדי הסמסטרים באמצעות אפליקציות כמו Whatsapp, Facebook ו Google Drive .\n\nלשיתוף באופנים אלו חסרונות רבים:\n•\tהמידע בדרך כלל נאבד או נשכח בתום הקורס באותו הסמסטר\n•\tאין דרך יעילה לחפש מידע רצוי בהיסטוריית שיחות או שאין שיחות כלל\n•\tלא נח להגיב ולדרג מסמכים שהועלו ב Google Drive .\n\nClassBook עוזרת לסטודנטים לשתף ולמצוא את חומרי הלימוד בצורה הקלה ביותר על ידי:\n•\tעיצוב מודרני\n•\tהעלאת קבצים נוחה\n•\tניווט ואיתור קל של קבצים\n•\tמערכת תגובות ודירוג למסמכים\n•\tאזור אישי למעקב אחרי הקורסים\n\n\nClassBook פותחה עם:\nצד שרת - Python, Django (Server-side framework)\nצד לקוח - HTML, CSS, JavaScript, Vue (Frontend framework) \nבסיס נתונים - SQLite\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e487",
//     workshopId: "613ce0fd6b3ab6b59152e48f",
//     title: "Noryoku ",
//     imageSrc:
//       "https://static.wixstatic.com/media/e296bd_c6b2bc901d274a2dafe7ca3738a8e51d~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210807",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "טל חזיזה בר יקר אלעד ויינברג",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גלובוס אורי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "מישחקים למידה ואפליקציות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://gitlab.com/talbaryakar/NoryokuApp",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "תתארו לכם שניתן היה לשנות את אורח החיים לבריא יותר ללא מאבקים, ללא כח רצון מיוחד ומבלי לצמצם קלוריות או להתאמן שעות בשבוע. קיימת שיטה כזו שנקראת בארץ \"הסוד היפני\". השיטה מבוססת על שינוי הרגלים ואימון מנטאלי, נוֹרִיוֹקוּ , שמקורו בג'וּגִ'יטסוּ, אומנויות הלחימה היפניות.\nאת השיטה פיתח מר נמרוד גוברין ואלפי ישראלים כבר עשו באמצעותה שינוי מתמשך באורח החיים שלהם. השיטה עבדה עד היום בשילוב של תכני וידאו קצרים וליווי ומעקב מתמשך של מספר שבועות של אחד מהמנטוֹרִים של השיטה באמצעות אפליקציית WhatsApp.\nניהול הפעילות עם WhatsApp איננו מיטבי הן עבור המנטורים והן עבור הלקוחות.\nלכן בשיתוף עם נמרוד גוברין פיתחנו אפליקציה שמאפשרת למנטורים לנהל טוב יותר כל לקוח ולהגדיל את מספר הלקוחות שכל מנטור יכול לנהל. בנוסף האפליקציה עוזרת ללקוחות בהטמעת השיטה ובמעקב אחר התקדמותם האישית. כמובן שלאפליקציה ייעודית יש גם ערך מוסף מיתוגי ועסקי.\nאמנם האפליקציה פותחה עבור לקוח ספציפי אך נראה שבהתאמות קלות היא יכולה לפתור בעיה דומה שיש למדריכי כושר ונותני שירות אחרים שהעבודה שלהם דורשת ניהול מעקב אחר התקדמות אישית של מספר גדול של לקוחות.\nהאפליקציה פותחה עם Xamarin כדי שתתאים לכל מכשיר נייד או נייח ועם שרת ASP.NET\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e487",
//     workshopId: "613ce0fd6b3ab6b59152e48f",
//     title: "Cygnus",
//     imageSrc:
//       "https://static.wixstatic.com/media/78a98f_df3e24028b9645a28a7bad7b7fc8ea2d~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210808",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "דריה זילברגרץ",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר גלובוס אורי',
//         value: ":שם המנחה",
//       },
//       {
//         key: "מישחקים למידה ואפליקציות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/dariazi/sadna",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "המשחק Cygnus מתרחש רחוק משביל החלב בגלקסיית .Cygnus תושביה של הגלקסיה שועבדו לאויב מסוכן ומתוחכם בשם Deus שכדי להבטיח את נצחיותו, פיזר עותקים של מוחו בחלליות ברחבי Cygnus. בכל חללית נתינים שטופי מוח שמגנים עליו בקנאות. השמועה אומרת שהוא מתכנן גורל דומה לשאר היקום. \nהשחקן הוא נווד אינטר-גלקטי שהחליט להציל את היקום, ולשם כך עליו להרוס את כל העותקים של Deus. הבעיה? עבור כל עותק שנהרס, יתר העותקים מעודכנים בהתאם. ולכן, עם כל שלב של המשחק האוייב משתדרג.   \nייחודו של המשחק הוא שבניית השלבים מתבצעת דינמית תוך שילוב בין machine learning  ל procedural generation ולכן אף שלב אינו חוזר על עצמו פעמיים. \nהמשחק פותח ב Unity. היריב מתעדכן באמצעות reinforcement learning מספריית ML toolkit שמתממשק עם Tensorflow.\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e480",
//     workshopId: "613ce0fd6b3ab6b59152e490",
//     title: "SayChess",
//     imageSrc:
//       "https://static.wixstatic.com/media/447b29_54fbd67f91444cb3a43aed8eaa08e6b1~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211001",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "יונתן דלוגץ יובל נלינגר אליהו לוינסון לימור שנקר",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר בריל גלסנר מיכל',
//         value: ":שם המנחה",
//       },
//       {
//         key: "ממשקים מוחשיים",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "SayChess הוא לוח שחמט חכם אשר מתחבר למחשב ומאפשר לשחקני שחמט עם עיוורון ולקויות ראייה לשחק אונליין, כאשר כל הפעולות מתבצעות בלוח בלבד ומסתנכרנות אוטומטית לאפליקציית השח Lichess.\n\nכיום, שחקני שחמט עם לקויות ראייה אשר משחקים אונליין נאלצים במהלך המשחק לעדכן את כל פעולותיהם באפליקציה, וכן בלוח הפיזי המותאם ללקויי ראייה שברשותם. SayChess מספק לשחקנים חווית משחק אותנטית וזהה למשחק פיזי - צורך שרק גבר בתקופת הקורונה, במהלכה נאלצו שחקנים רבים לעבור למשחק אונליין במקום משחק פנים אל פנים. \n\nלוח SayChess הוא לוח מותאם ללקויי ראייה, שבו הותקנו 64 מגנטים ומפסקים אשר מחוברים ללוח Arduino Leonardo, ומאפשרים לזהות את תנועת כלי השחמט על גבי הלוח. תזוזות הכלים מפוענחות באמצעות קוד בשפת C שרץ על לוח ה- Arduino, ומדמה את השימוש במקלדת מול האפליקציה. \nבנוסף, הלוח מכיל מספר כפתורים אשר מאפשרים לבצע פעולות נוספות במהלך המשחק, ביניהם כפתור להתחלת משחק חדש באופן אוטומטי, על ידי הרצת סקריפט ב- Python תוך שימוש ב Selenium.\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e491",
//     title: "TUP",
//     imageSrc:
//       "https://static.wixstatic.com/media/f731c8_f65fe280cf8d45eb9643e239ec4560a6~mv2.png/v1/fill/w_274,h_161,al_c,lg_1,q_85/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210701",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "מתן פרץ יעל דוידוב מאיה ארגמן גל מיליס",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח אפליקציות מובייל",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/YaelD/TUP_App",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "תכנון טיול הוא לעיתים קרובות משימה מאתגרת. למעט ההחלטה על יעד הטיול ובחירת המלון, עבודת סידור האטרקציות וחלוקתם לפי ימים עלולה להתגלות כמשימה סיזיפית שגוזלת זמן רב.\n\nאפליקציית TUP-Traveling Using App חוסכת לכם זמן! בעזרת מאגרי מידע ותוך שימוש ב-AI, האפליקציה יכולה ליצור מסלולי טיול מותאמים אישית. כל מה שאתם צריכים לעשות זה להזין יעד, תאריכים, ובאלו אטרקציות תרצו לבקר, והאפליקציה תדאג ליצור לכם מסלול טיולים אידיאלי, כך שתוכלו לנצל את כל ימי הטיול במלואם!\n\nבנוסף לסידור האטרקציות בהתאם לימים, האפליקציה כוללת מידע שימושי על אטרקציות בהן תרצו לבקר. כך שתוכלו גם לחפש אטרקציות בזמנכם הפנוי ולשמור אותם עד לטיול הבא. גם בקורונה אפשר לחלום.\n\nטכנולוגיות שבהן השתמשתנו:\nData Base- MySQL\nAPIs- Wiki API, Google API.\nServer Side- Java, Tomcat, Amazon RDS\nClient Side- Java, XML",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e491",
//     title: "MaMarkiv",
//     imageSrc:
//       "https://static.wixstatic.com/media/86cde1_3bcb613126314e45beca969c09e0ad74~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210703",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "רונאל גכמן קרינה בטמנישוילי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח אפליקציות מובייל",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'סיפורו של סטודנט רעב בקרנף:\nהזמנתי סלט ותיבלתי אותו ברוטב המכונה "אלף האיים". היות ואני סקרן מטבעי, תהיתי מהם אותם אלף איים שעל שמם קרוי הרוטב. מעיון ברשימת המרכיבים של הרוטב, הבחנתי שיש בו E121, E189, E159, E119, E209, E202. פתאום צצה לי הארה - הנחתי שאם אחבר את כל המספרים, אקבל בדיוק אלף E ותיפתר תעלומת השם.\nחיברתי את כל המספרים וגיליתי ש"עבדו" עלי, ברוטב שקיבלתי היו 999 E-יים בלבד. לא התעצלתי ושלחתי מייל לחברה. תוך זמן קצר קיבלתי תשובה המבהירה שה-E שחסר נובע כנראה מ-E הבנה.\n\nכאן נכנסת לתמונה MaMarkiv שבאה לפתור את E ההבנה הזו. \nMaMarkiv הנה אפליקציית Android באמצעותה המשתמש מצלם את רשימת המרכיבים על גב האריזה ומקבל פיענוח ותרגום אודות מרכיבי המוצר. האפליקציה מבצעת סריקה חכמה של הטקסט על התווית ומספקת בהתאם מידע מבסיס נתונים. בנוסף, המשתמש יכול לשמור צילומי תוויות ולחזור אליהן שוב בעתיד.\n\nהאפליקציה פותחה ב-Android Studio  ונכתבה ב-JAVA. צד השרת, מבוסס FIREBASE, וצד הלקוח, מבוסס אנדרואיד, מתקשרים באמצעות HTTP. נעשה גם שימוש בטכנולוגיית OCR לזיהוי טקסט מתמונה.',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e491",
//     title: "RunWithMe",
//     imageSrc:
//       "https://static.wixstatic.com/media/b42bde_1a090da3fcc643ccb5798f1bc542ca3f~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210704",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "ארז לב ליאור לפיד שחר כלפון",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח אפליקציות מובייל",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/erez-lev/Run-With-Me-Client",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "RunWithMe הינה אפליקציית מובייל המיועדת עבור קבוצות ריצה. האפליקציה מאפשרת ליצור קבוצות ריצה עם חברים ולקבל נתוני ריצה בזמן אמת על ריצות משותפות. במהלך הריצות, RunWithMe משתמשת בחיישנים הנמצאים במכשיר הנייד כדי לאסוף נתונים על כל אחד מהרצים בקבוצה. הנתונים מעובדים, ומידע רלוונטי מוצג ומסייע לרצים במעקב אחר ביצועיהם האישיים והקבוצתיים. בנוסף לחיישנים מתבצע שימוש בנתוני GPS כדי להציג בזמן אמת את מסלול הריצה.\n\nלאפליקציה ממשק משתמש נוח לניהול ריצות, קבוצות וחברים באופן אינטואיטיבי. RunWithMe תומכת בנוסף בריצות אישיות ומנהלת היסטוריית ריצות עבור משתמשים וקבוצות.\n\nהטכנולוגיות בהן השתמשנו הן:\nצד הלקוח – Android Studio, Kotlin\nצד השרת – Node.js, JavaScript\nבסיס הנתונים – MongoDB - NoSQL",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e491",
//     title: "TinDog",
//     imageSrc:
//       "https://static.wixstatic.com/media/0aecc4_f67b1eadc0944e5892c1123f4b11aeb0~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210705",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "שחף מחלוף ניצן רחום פלג שולץ גל קלש",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח אפליקציות מובייל",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/ShahafMachluf/final-project",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "אלפי כלבים עזובים מומתים כל שנה בישראל בשל מצוקת מקום בכלביות. נראה שניתן יהיה לצמצם את היקף הבעיה באופן משמעותי, אם יותר אנשים יבחרו לאמץ כלבים במקום לקנות.\n\nהאפליקציה שפיתחנו נועדה להפוך את תהליך האימוץ לפשוט ונגיש יותר ובכך לעודד אימוץ על פני קניה. האפליקציה מהווה פתרון לבעלי כלבים למסירה ולמעוניינים באימוץ כלב. מאמצי כלבים זוכים לליווי משלב חיפוש החבר החדש שיזכה בבית חם ועד לשלבי הטיפול היומיומי בו, וזאת באמצעות הפיצ'רים הבאים:\n1.      הצגת הכלבים הזמינים לאימוץ לפי מיקום.\n2.      אופציה לניהול שיחת צ'אט בין מאמצי כלבים פוטנציאלים לבין מוסרי כלבים.\n3.      מידע אודות וטרינרים ובתי עסק רלוונטיים בסביבת המאמץ.\n4.      מפה המציגה גינות, חופי כלבים וכו'.\n\nהטכנולוגיות בהן השתמשנו הן:\nצד הלקוח - JavaScript, React Native\nמערכת ניהול - JavaScript, React\nצד השרת -  C#, ASP.NET, Entity Framework, WebSocket\nבסיס הנתונים- SQL server\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e491",
//     title: "SneakPic",
//     imageSrc:
//       "https://static.wixstatic.com/media/fd11c9_4f8e906fe33540a2a5d0a272d41369e8~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210708",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "לירן בכר הדר דהן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח אפליקציות מובייל",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "SneakPic היא פלטפורמה חברתית שיתופית המאפשרת לצלמים מקצוענים וחובבים להעלות לרשת, לשיתוף ולמכירה, תמונות שצילמו - בעיר, בים, בטבע או אפילו באירועים מאורגנים.\nחושבים שאתם מספיק מוכשרים כדי לנסות? צלמו אלבום, תייגו תחת זמן ומקום, ויש לכם הזדמנות לקרדיט, לחיזוק הנטוורקינג, ואולי גם ללקוחות חדשים.\nובצד השני - טיילתם בעיר? הייתם בים? במגרש? בפארק? דווחו לאפליקציה על המיקום והשעה וקבלו התאמות של תמונות שצולמו באזור זה באותו זמן – אולי גם אתם צולמתם.\nSneakPic תומכת גם בחיפוש תמונות באמצעות זיהוי פרצופים, דירוג של צלמים, ועוד.\n\nהפרויקט פותח כאפליקציית Web - בצד השרת בשפת Java עם Spring Framework. צד לקוח: JavaScript. כלים נוספים: Google Maps API.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e491",
//     title: "ChordAR",
//     imageSrc:
//       "https://static.wixstatic.com/media/ac370b_0d921003faf54ae1b898c0123ea7ad32~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210707",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "אלמוג שמעון אורון בורטמן אלה מיליאבסקי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח אפליקציות מובייל",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value:
//           "https://github.com/ellaml/chordAR, https://github.com/Almog16/Py-ChordAR",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "ChordAR היא אפליקציית מובייל מבוססת טכנולוגיית מציאות רבודה (AR) ללימוד אקורדים לגיטרה.\n\nהאפליקציה מספקת דרך חדשה ומותאמת אישית ללימוד אקורדים - החל מחיפוש סימוני אקורדים ועד הגדרת מעברים של אקורדים. המשתמשים קובעים את סדר האקורדים ומשך הצגת האצבוע שלהם.\n\nמשתמשים יכולים לקבל חיווי והנחיות לאצבוע נכון על גבי מיתרי הגיטרה האישית בזמן אמת, תוך כדי לימוד ואימון. לצורך זה, ChordAR מצלמת את פעולות המשתמש באמצעות המצלמה הפנימית של המכשיר, מנתחת את צילומי הוידאו, מזהה את צוואר הגיטרה ומיתריה, ומציגה את הוידאו בתוספת סימנים למיקום נכון של האצבעות (לפי האקורד המבוקש) על צילומי הוידאו.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "AutoLight",
//     imageSrc:
//       "https://static.wixstatic.com/media/8edeae_0372001d491c494fb95c8c04510a6e12~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210101",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עידן אלעזר אלונה דנוצה דנית לוי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "כמעט כל בעל רכב נתקל מדי פעם בנורה דולקת בלוח המחוונים שמשמעותה לא ברורה. מצב זה עלול לגרום לתחושת חוסר אונים - האם בטוח להמשיך לנסוע ברכב? האם זו בעיה שניתן לפתור עצמאית? האם נדרש לנסוע למוסך או לקרוא לגרר? הנהג יכול לחפש מידע רלוונטי בספר הרכב או באינטרנט, אבל חיפושים כאלו עלולים לקחת זמן רב ולא תמיד מניבים תוצאות מספקות, מאחר ומידע מפורט אודות נורות הרכב לא תמיד נגיש בצורה נוחה ומהירה.\n\nלצורך כך פיתחנו את AutoLight - מערכת לזיהוי נורות דולקות בלוח המחוונים המציגה מידע מפורט וממליצה כיצד לפעול. המערכת מאפשרת להעלות תמונה של לוח המחוונים ולקבל מידע אודות הנורות הדולקות ברכב. כמו כן, המערכת תומכת באופציית חיפוש נורות רכב ללא העלאת תמונה. באמצעות המערכת הנהג יכול לקבל באופן מידי מידע חיוני שעשוי לעזור לו, גם בזמן אמת בקבלת ההחלטה לגבי המשך הנסיעה ברכב.\n\nטכנולוגיות בהן פותחה AutoLight :\nצד השרת : Node.js וספריית עזר Selenium WebDriver \nצד הלקוח: React וספריות עזר, כגון Redux ו-Axios\nבסיס הנתונים : Microsoft SQL Server תוך התממשקות עם AWS\nעיבוד תמונה : OpenCV ,Python",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "DoTubes",
//     imageSrc:
//       "https://static.wixstatic.com/media/b72ab1_28b8066ff344473c8ec9f8595173f889~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210102",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "גבריאל זנקו שגיא כהן נדב ספינקו איתן חן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'DoTubes הינו מוצר אנליטי המסייע למנהלי פרויקטים וראשי צוותים לחלק משימות בין עובדים ולעקוב אחרי הביצוע, תוך שיפור וייעול עבודת הצוותים.\n\nאיך המוצר עובד?\n\nDoTubes מנהל קבוצות שבראשם ראשי צוותים, אשר תפקידם לנהל את עבודת הצוות. לכל קבוצה מוגדרות משימות עיקריות, כשכל משימה מיוצגת ויזואלית כמבחנה, בה ניתן לראות את התקדמות המשימה. משימות עיקריות כוללות תתי משימות ולכל תת משימה מוגדרת ע"י ראש הצוות רמת תיעדוף. כשעובדים מסיימים לבצע משימה הם ממלאים סקר ובו משוב על שביעות רצונם מהמשימה.\n\nמשוב העובדים נאסף ומנותח ע"י DoTubes ותוצאות הניתוח מוצגות לראשי הצוותים. ראשי הצוותים יכולים ללמוד מהתוצאות לגבי עבודת הקבוצה ושביעות הרצון של העובדים, לשפר את ההיכרות עם העובדים ולזהות נקודות חזקות וחולשות. בהתאם, ראשי הצוותים יכולים להתאים את פעילותם ובכך לייעל את העבודה.\n\nטכנולוגיות שבהם השתמשנו לבניית המוצר:\nצד שרת: Node.js.\nצד לקוח: React.js.\nבסיס נתונים: MongoDB.',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "Cap & Calc",
//     imageSrc:
//       "https://static.wixstatic.com/media/a80f6d_8684aee88c7d4b58b3c74bb38a3bff51~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210103",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עומר צדקוני נאור פשאי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'מודעות לערכים תזונתיים וקלוריות במזון שאנחנו צורכים - חיונית לבריאות שלנו. בעוד שמידע רלוונטי לגבי מוצרי מזון הנרכשים בסופר מוצג בד"כ על האריזה, בהזמנת אוכל במסעדות המידע בד"כ לא זמין והשליטה לגבי מה אנחנו צורכים מוגבלת יחסית.\n\nהפתרון שלנו לבעיה זו הוא אפליקציית Cap&amp;Calc, המאפשרת סריקת תפריטים במסעדות והצגת מידע על המנות שבתפריט לפני ההזמנה. האפליקציה מנתחת את שם המנה, רכיבי המנה והתמונה, ועל בסיס מידע שנאסף מהאינטרנט, מחשבת ומציגה מידע רלוונטי והערכה של הערך התזונתי של המנה. האפליקציה מהירה וקלה לשימוש ומאפשרת לשמור מנות אהובות ולראות את היסטוריית החישובים והצילומים.\n\nהייחודיות של Cap&amp;Calc אל מול אפליקציות אחרות ברשת היא שאפליקציה זו מתמקדת בניתוח מנה על בסיס התפריט, ללא צורך בצילום המנה עצמה, מה שמאפשר קבלת מידע לפני ההחלטה מה להזמין.\n\nהפרויקט פותח ב-JavaScript עם Node.js בצד השרת  ו-React Native בצד הלקוח. ',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "SingIt",
//     imageSrc:
//       "https://static.wixstatic.com/media/821ca0_fa3e9f995549492a93a9a76db1c1634f~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210104",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "בן רחמיאן מאור גורמס איליה גורביץ",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "SingIt הוא תוסף לדפדפני אינטרנט עבור משתמשי YouTube שאוהבים להאזין לשירים. התוסף  משפר את חווית המשתמש באמצעות תוספת כלים ומידע על השיר המתנגן.\n\nSingIt תומך בהצגת מילות השיר באופן אוטומטי, כך שאין צורך לחפש את המילים ברחבי האינטרנט. במוד קריוקי, מילות השיר מוצגות בהתאם להתקדמות סרטון ה-YouTube – שימושי  עבור משתמשים המעוניינים לעקוב אחרי מילות השיר תוך כדי השמעתו ולהצטרף בשירה או בנגינה.\n\nבנוסף, SingIt מציג למשתמש מידע ולינקים שימושיים, כולל כפתור המעביר את המשתמש לפלטפורמה המציגה אקורדים לשיר, פתיחת השיר ב-Spotify, ועוד.\n\nהטכנולוגיות בהן השתמשנו הן:\nצד הלקוח –React, HTML, CSS, TypeScript.\nצד השרת –  WEB API הנכתב ב-C#.\nבסיס הנתונים – SQL Server.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "Ivern",
//     imageSrc:
//       "https://static.wixstatic.com/media/5a1e23_893cc6c05f804883bff8072b56264a94~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210105",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "יקיר הלל",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/Yakir-Ben-Hillel/Ivern-app",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'Ivern הינה פלטפורמה שנבנתה עבור הקהילה, להמרה והחלפה של משחקי יד שנייה עבור קונסוליות משחק.\n\nהבעיה: חוסר ניצול של משחקים שמשתמשים סיימו לשחק בהם, על אף הפוטנציאל לשימוש ע"י אחרים.\n\nהפלטפורמה יוצרת שוק יד שניה למשחקים ומנגישה את כלל המשחקים הפנויים. ניתן להציג למכירה או החלפה משחקים פנויים, וכן לחפש משחקים פנויים ע"פ מיקום, סוג, או שם משחק ספציפי. הפלטפורמה תומכת גם בתקשורת בין המשתמשים באמצעות צ\'אט.\n\nלאתר שני ממשקי משתמש שונים: למובייל ולדסקטופ.\n\nטכנולוגיות בשימוש:\nReact (w/Hooks and Redux)\nServerless Computing using Google Firebase\nFirestore noSQL Database\nCloud Functions for API management\nAuto Games fetching and updating API\nPub/Sub image uploading\nSocket.io messaging\nMachine learning based image validation\n\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "Walk with me",
//     imageSrc:
//       "https://static.wixstatic.com/media/133a64_ad6e0d8c6dc34c7fae43799633d0f57a~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210106",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "שירן ראסק גיל גרינבאום תומר אביבי ניב גיצי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "Walk with me הינה אפליקציית  web המהווה פלטפורמה לבעלי כלבים ודוגווקרים (dog walkers).\n\nהאפליקציה מאפשרת לדוגווקרים להציג את עצמם ולבעלי כלבים לבחור דוגווקרים, ע\"פ העדפותיהם, מבחינת עלות, זמינות, מיקום, פעילויות שיש לבצע עם הכלב, וכד'.\n\nWalk with me מאפשרת לשני הצדדים לקיים תקשורת רציפה בכל הנוגע לטיול עם הכלב ולנהל check list של פעילויות הנדרשות לביצוע עם הכלב.\n\nבנוסף, האפליקציה מקנה לבעלי הכלבים את היכולת לעקוב אחרי הכלב בזמן הטיול באמצעות ניתור מיקום, וכן וידאו צ'אט בו יוכל הבעלים לראות את כלבו באמצעות המצלמה בטלפון הנייד של הדוגווקר.\n\nצד הלקוח – react native ,JavaScript.\nצד השרת –  Java.\nבסיס הנתונים – MySQL.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "Movieez",
//     imageSrc:
//       "https://static.wixstatic.com/media/180c8d_7df0c3cf08d3451a92c43e91567ef7f6~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210108",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "שחר שדה אריאל טודריה טל גרוס",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "האפליקציה היא מערכת לחיפוש והצגת מידע על סרטים המוקרנים ברשתות בתי הקולנוע בישראל.\n\nמרבית רשתות הקולנוע בארץ מפעילות אתרים למכירת כרטיסים. משתמש המעוניין לרכוש כרטיס לסרט נדרש לתהליך מסורבל הכולל ביקור באתרי הרשתות הפעילות באזור מגוריו וביצוע השוואה באופן עצמאי בין הסרטים המוצגים בכל רשת, שעות הצגתן, סוגי האולמות, מקומות פנויים בכל אולם וכו'.\n\nמטרת האפליקציה היא לפתור בעיות אלו ע\"י הנגשת ממשק יחיד ונוח באמצעותו ניתן לקבל מידע על סרטים המוקרנים במגוון בתי הקולנוע בישראל, כולל שעות הקרנה, סוגי אולמות ומיקומים. ממשק האפליקציה מעניק חווית משתמש בסגנון Netflix המאפשרת חווית חיפוש והצגה של סרטים, קבלת מידע מורחב אודותיהם, דירוגים, ביקורות, חוות דעת משתמשים, טריילרים, המלצות, רשימות מותאמות אישית ועוד.\n\nבניגוד לאפליקציות VOD, אפליקציה זו ייעודית לבתי קולנוע. הרעיון הוא לספק למשתמש חוויה אינטראקטיבית וחדשנית (אותה הוא רגיל לקבל באפליקציות טלוויזיה) בעת חיפוש ובחירת סרטי קולנוע. חוויה זו אינה ניתנת כיום באתרי האינטרנט של בתי הקולנוע בארץ, המציגים כיום מערכת סטטית ומונוטונית (ואף מיושנת) לחיפוש ובחירה של סרטים.\n\nאפליקציית המשתמש הינה Web-ית ופותחה באמצעות פלטפורמת React, וכמו כן כוללת שרת Web API שפותח בטכנולוגית .NET Core",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "EasyTrip",
//     imageSrc:
//       "https://static.wixstatic.com/media/6bb0e8_3ee1cb983daf4d55ad81562117fc2660~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210109",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "בר מלכוב סהר לילה אורי אדלר יותם מושקוביץ",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           '\nבעולם מוצף במידע, כשחופשה בחו"ל היא מוצר צריכה בסיסי, Easy Trip היא בדיוק מה שאתם צריכים.\n\nEasy Trip היא אפליקציית WEB לתכנון טיול מותאם אישית. תכנון חופשה בחו"ל כולל לרוב חיפוש טיסה, מלון, אטרקציות ואמצעי תחבורה, כשהמידע הרלוונטי מפוזר ברחבי הרשת. האפליקציה מרכזת מידע לגבי תחבורה, אטרקציות, מלונות וטיסות, ומלווה את המשתמש בכל שלבי התכנון, באמצעות ממשק משתמש נוח וידידותי.\n\nהאפליקציה תומכת ביצירה אוטומטית של תוכניות טיול על בסיס העדפות משתמשים, תוך שקלול מידע, כגון יעדים שאסור לפספס וזמני הגעה ממקום למקום. בנוסף, ניתן לערוך תוכניות טיול או ליצור תוכניות טיול באופן ידני ובסיוע המלצות של האפליקציה. בסוף התהליך, המשתמשים מקבלים לו"ז מוכן לטיול, שניתן להדפיס או לייצא למסמך.\n\nטכנולוגיות:\n\nReactJS , Java, Maven Framework, MySQL, Hibernate, Google API, Amadeus API, Numbeo API.',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "Makes",
//     imageSrc:
//       "https://static.wixstatic.com/media/3d0fb8_a4ccfab7cc1d4d7a9fa9a5200c88133d~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210112",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "עדי שץ ניר בר-לבב לילך בירנבוים גבי סיון",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/AdiShatz/Makes",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "Makes הינה פלטפורמה אינטרנטית לכתיבת ספרי ילדים, המיועדת בעיקר להורים המעוניינים לכתוב ספר מותאם אישית לילדים שלהם.\nהפלטפורמה מספקת תבניות מוכנות (טמפלטים) של ספרי ילדים בהן ניתן לשלב שמות מתואמות אישית, וכן להוסיף נקודות מפנה שונות לסיפור, ובכך ליצור בקלות ובנוחות סיפור אינטראקטיבי עם משמעות אישית עבור הילד.\n\nבעולם שבו ישנם פחות ופחות ספרים על המדפים, Makes מספקת חווית קריאה שונה וייחודית לילד ולהורה ומאפשרת להם להנות מסיפורי ילדים ולהתאהב בעולם הספרים.\n\nכלים וטכנולוגיות פיתוח: Java, Spring, Maven, Docker, MongoDB, React.js, JavaScript, HTML, CSS, Node.js\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e492",
//     title: "Schedule Builder",
//     imageSrc:
//       "https://static.wixstatic.com/media/11179c_4f96c97b4bde40f58ca8db2b61395013~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210111",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "ג'ואד חמדאן קורל פלח ספיר נחמני",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח יישומי אינטרנט",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "Schedule Builder הוא אתר אינטרנט המשמש ככלי עזר לסטודנטים בזמן הרישום לקורסים. המטרה היא לסייע בבחירת קורסים וקבוצות לימוד וביצירת מערכת שעות נוחה ויעילה.\n\nהמערכת דולה מידע רלוונטי באופן אוטומטי, כולל לגבי תכנית הלימודים הרלוונטית - מקובץ ידיעון בפורמט PDF, ולגבי זמני הוראת הקורסים - מאתר המכללה.\n\nלמשתמש מוצג ממשק נוח לשיבוץ קורסים והרכבת מערכת שעות לפי סמסטר, תוך התחשבות בתלויות ותנאי קדם, בשעות השיעורים בקורסים ועוד.\n\nהרעיון לפרויקט עלה בעקבות זיהוי הצורך להקל על ההכנות הידניות הנדרשות לפני רישום לקורסים, שכוללות בדיקת חפיפת זמני קורסים, בדיקת דרישות קדם ודרישות מקבילות.\n\nטכנולוגיות:\nצד שרת: Python, Flask\nצד לקוח: JavaScript, React\nבסיס נתונים: Firebase, SQLite",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e481",
//     workshopId: "613ce0fd6b3ab6b59152e493",
//     title: "UnboxinGrave",
//     imageSrc:
//       "https://static.wixstatic.com/media/df6b57_736ea05e4a6240349c1975beb18f53d1~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211301",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "יוני אנדר",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר סולאמי משה',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח משחקים / תכנות מקבילי",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/Yoni491/monogame-client-server",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "UnboxinGrave הוא משחק תפקידים מרובה משתתפים בדו מימד שמבוסס על מנוע המשחק MonoGame ושפת התכנות #C.\nבמשחק השחקן יצטרך להילחם באויבים, להרוויח חפצים ונשקים ולשרוד את כל השלבים על מנת לנצח בו. ניתן לשחק את המשחק במחשב עם שלט או עם מקלדת ועכבר.\nשרת המשחק מאפשר לשחק את המשחק עם מספר לא מוגבל של משתתפים. השרת נבנה על גבי sockets בשפה #C ועוצב בצורה כזו כך שיהיה יעיל לעבודה עם מספר רב של שחקנים.\nMonoGame זו תשתית משחקים בלבד שדורשת פיתוח מאפס של הרכיבים, לעומת מנועי משחק כמו Unity או Unreal Engine במשחק פותחו כל הרכיבים באופן עצמאי: אנימציות, תפריטים במשחק, אלגוריתמי התמצאות במרחב, פונטים, גרפיקה ועוד דברים נוספים. \nמטרת המשחק היא לאפשר למספר משתתפים להתחבר יחדיו לשרת ולהנות מחוויית משחק קלילה ומהנה באורך שעה - שעתיים.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e481",
//     workshopId: "613ce0fd6b3ab6b59152e493",
//     title: "Poker Arena",
//     imageSrc:
//       "https://static.wixstatic.com/media/458dd5_c11678a0d84348a39139d7557579b07a~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211302",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "יוסי דניאלס מאיר שטרקמן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר סולאמי משה',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח משחקים / תכנות מקבילי",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "שחקני פוקר רשת רבים מחפשים אינטראקציה חברתית נוספת מחוץ לשולחן הפוקר, כך שיוכלו להעביר חוויות ותובנות בלי לפגוע ברצף המשחק.\nPOKER ARENA מאפשר לשחקנים להתחבר לחדר משחק פתוח בו הם יכולים לטייל עם הדמות שלהם, להכיר ולשוחח עם שחקנים בעולם בעזרת שרת המאפשר קליטה בזמן אמת של התנועות וההודעות של כלל המשתמשים, ולהיכנס לשולחן פוקר משותף כשהם רוצים לשחק פוקר יחדיו או לצפות אחד בשני משחקים.\n\nצד השחקן מומש בשפת c# בעזרת תשתית MONOGAME וספריית MonoGame.Extended, צד השרת מומש בעזרת ASP.NET Framework לפעולות REST API. כמו כן, נעשה שימוש בSQL Server הממתמשק עם Entity Framework לשמירת נתוני השחקן.  \n\nאצלנו בPOKER ARENA אנו מציעים עולם פתוח בנוסף לחוויית משחק הפוקר המוכרת.\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e488",
//     workshopId: "613ce0fd6b3ab6b59152e494",
//     title: "GetSanger",
//     imageSrc:
//       "https://static.wixstatic.com/media/e28178_ab0fe2cdc27547bcb58598bc30422f89~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "210501",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "רפאל דורון מאור משה גולן אהרוני שחר בר",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: "מר רונן גיא",
//         value: ":שם המנחה",
//       },
//       {
//         key: "פיתוח תוכנה בטכנולוגיות דוט נט מתקדמות",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value:
//           "https://client: https://github.com/MaorBen-Moshe/GetSanger; server: https://github.com/4shachar/GetSangerCloudFunctions",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "GetSanger היא אפליקציה למכשירים ניידים אשר מסייעת לקשר בין אנשים שצריכים עזרה במשימות יומיומיות לבין אנשים שמוכנים לעמול עבור שכר.\nהפלטפורמה מאפשרת למשתמשים להרוויח כסף בתמורה למתן שירות או לקבל שירות בתשלום, מתוך מגוון קטגוריות שאינן דורשות בהכרח הסמכה או ידע מיוחד (משלוחים, סידורים, תיקון מכשירים ביתיים, עזרה בלימודים ושיעורים פרטיים, תיקון ותפעול מחשבים וסמארטפונים, ניקיון, הנדימן, חשמלאים, גינון, חיות מחמד, רכב, טיפוח ויופי).\nנותני השירות ידורגו על ידי צורכי השירות כדי להבטיח את טיב השירות וכדי לעודד נותני שירות לבצע את עבודתם בצורה הטובה והאיכותית ביותר, כמו גם נותני השירות ידרגו את מקבלי השירות כדי להבטיח שההתנהלות של צורך השירות מול הס'אנגר תהיה בצורה ראויה.\nכחלק מחוויית המשתמש יוכלו צורכי השירות ונותני השירות לדבר ביניהם באמצעות צ'אט אינטגרלי באפליקציה, לקבל התראות פוש עבור עדכונים והצעות עבודה, בנוסף, מעקב אחר מיקום הס'אנגר (נותן השירות) בזמן אמת על מפה.  כמו כן ניתן להתחבר ישירות דרך רשת חברתית כגון פייסבוק וגם מעבר מהיר מהאפליקציה לאפליקציית הוואטסאפ לצורך המשך תקשורת בין הצדדים ושיחות טלפוניות.\nהאפליקציה כתובה בשפת #C, משתמשת בצד לקוח בטכנולוגיית Xamarin .NET  תוך שימוש ב xaml ו -  #C למימוש ממשק המשתמש.\nבצד שרת, קוד השרת כתוב ב #C תוך שימוש ב FireBase.\n",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e495",
//     title: "ANIMO",
//     imageSrc:
//       "https://static.wixstatic.com/media/8e21ff_8bb80dad841247bf8a4272a25868d798~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211107",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "שירה אוסטרינסקי אלון הרוש שיר אלפנבוים יאיר דנה",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פתרונות תוכנה מתקדמים",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/alonbh5/Animo-Web",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'האפליקציה ANIMO מאפשרת למשתמשים בה לנתח את מצבם הרגשי ולמצוא דרכים פרקטיות לשפר את אושרם הפנימי.\n\nשנת 2020, הציבה את אוכלוסיית העולם מול אתגרים חדשים. נגיף הקורונה שהגיח לחיינו חייב שינויים קיצוניים בשגרת החיים. בידוד וריחוק חברתי, סגר וביטול אירועי תרבות ופנאי הם חלק מאסטרטגיות ההתגוננות מפני הנגיף, אך יש לכך מחירים נפשיים ובריאותיים: בדידות, עצבות, דיכאון, חרדה ומצבי רוח משתנים.\n\nהאושר הפנימי שלנו נובע מתוך תחושה פנימית הנקבעת ע"פ מרכיבים שונים ואישיים לכל אדם. מטרת האפליקציה היא להעלות את המודעות ולאפשר טיפוח של המרכיבים הגורמים לאושר לכל אדם ואדם.\n\nמשתמשי ANIMO יכולים לבצע מספר פעולות מרכזיות:\nניתוח רגשי – האפליקציה מסייעת למשתמשים להגדיר באופן נקודתי (בנקודת זמן מסוימת) את מצבם הרגשי.\nעצה והכוונה - האפליקציה מספקת משוב אישי ועצות לפעולות אקטיביות.\nתמיכה מאיש מקצוע - האפליקציה מאפשרת לקשר משתמשים לגורמי מקצוע לצורך טיפול אישי.\n\nהטכנולוגיות בהן השתמשנו:\nצד הלקוח – React, HTML, CSS, TypeScript\nצד השרת – Node.js, JavaScript\nבסיס הנתונים – MongoDB',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e495",
//     title: "PlanEvent",
//     imageSrc:
//       "https://static.wixstatic.com/media/1fc15b_7971ba6b99f547b08bcdd6049a06403a~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211103",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "רועי פסברג אוראל משה",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פתרונות תוכנה מתקדמים",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "תכנון אירועים הינו עולם מורכב הכולל עבודה מול מגוון ספקי שירות ואורחים. תכנון אירוע עלול להכביד ולהקשות על המארגנים בשל הצורך לבצע רשימת מטלות ארוכה, כולל תיאום ספקים, הזמנת אורחים, קבלת אישורי הגעה, שיבוץ אורחים לשולחנות, ועוד.\n\nאפליקציית PlanEvent מנגישה את עולם תכנון האירועים למשתמש בצורה פשוטה ונוחה. האפליקציה תומכת בניהול רשימת משימות, ריכוז ספקים, טיפול ברשימת מוזמנים, שיתוף האירוע עם מארגן נוסף, ועוד. בנוסף, האפליקציה מציעה למשתמש אופציה של סידור שולחנות חכם, ובכך מסייעת במשימה המורכבת של שיבוץ אורחים לשולחנות.\n\nהאפליקציה ממומשת באמצעות Java בצד השרת והלקוח (צד הלקוח פותח באמצעות Android Studio). המידע נשמר ומנוהל בבסיס נתונים MySQL.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e495",
//     title: "Olakino",
//     imageSrc:
//       "https://static.wixstatic.com/media/f7ba0c_ef38fb01f16a4e0cb31ab5b20d3f92de~mv2.jpg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211102",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "בר הרן גל חי תומר וויגה לירון כהן",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פתרונות תוכנה מתקדמים",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           "Olakino הינה אפליקציית web שנועדה להנגיש אורח חיים בריא לכלל האוכלוסייה. המשתמש ממלא שאלון בריאותי והאפליקציה בונה עבורו תוכנית תזונתית אישית, כמו גם תוכנית אימונים מותאמת אישית. האפליקציה שמה דגש על ההיבט החינוכי ומטרתה לספק למשתמש מידע וכלים שבעזרתם יוכל לאמץ אורח חיים בריא והרגלים שישפרו את בריאותו. בנוסף, האפליקציה מאפשרת חיפוש מתכונים בהתאם להעדפות תזונתיות ופרמטרים בריאותיים שונים, ומציגה ניתוח תזונתי של מתכונים אלו ואפשרות לשילובם בתוכנית התזונתית.\n\nטכנולוגיות בהן השתמשנו:\n\nצד לקוח:\nReact ליצירת רכיבי UI ו-Bootstrap לעיצובם. נעזרנו בספריות נוספות, כגון: axioms לטובת ניהול בקשות HTTP ו-react-hook-form לניהול forms ו validation.\n\nצד שרת:\nשפת התכנות בה השתמשנו היא Python ונעזרנו ב Flask כ-web framework.\nמסד הנתונים בו השתמשנו לשמירת המידע הוא PostgreSQL.\nבנוסף נעזרנו ב-API של שירות Edamam, לצורך אחזור מתכונים לבניית תוכניות תזונה.\nהשרת מותקן ורץ על AWS.",
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e495",
//     title: "Bet You Smart",
//     imageSrc:
//       "https://static.wixstatic.com/media/04503e_eb731b4f3dc142f79a4d9ef8f85e882a~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211104",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "תמיר אור ג'ורג' גרמה דור זאבי",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פתרונות תוכנה מתקדמים",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'הפרויקט מממש מערכת ליצירת הימורי ספורט על בסיס חוזים חכמים (smart contract). המערכת כוללת ממשק WEB המאפשר לקשר ארנק דיגיטלי, ליצור חוזי הימורים חדשים ולחפש חוזי הימורים שנוצרו בעבר.\n\nליצירת חוזה, המשתמש מזין את פרטי ההימור - סכום כניסה, תאריך אחרון לכניסה וכיו"ב, ובנוסף, האם החוזה הוא unlisted או public. עם סיום הכנסת הפרטים המערכת מייצרת את החוזה ומעלה אותו אל רשת ה-blockchain. המשתמש מקבל id על מנת לממשק את החוזה עם הארנק שלו ולשתף עם חבריו או באתר. המערכת מקושרת למידע מליגות ספורט שונות ומאפשרת למשתמש ליצור חוזים על סמך אירועי ספורט מתוכננים.\n\nניתן לחפש חוזה ע"פ פרטים מזהים, כגון: ID, ליגה, קבוצה משתתפת, וכו\'.\n\nהמערכת מאפשרת יצירת חוזי הימורים ללא תלות בישות מרכזית, והימור בצורה דיסקרטית מול אנשים בכל העולם.\n\nטכנולוגיות בהן השתמשנו:\n\n·        האתר והשרת נכתבו בpython flask framework.\n\n·        השרת המייצר את החוזים (מטא תכנות המקבל כקלט קוד בptyhon ומייצר קוד בsoldity) נכתב בpython.\n\n·        החוזים החכמים מתבססים על טכנולוגיות blockchain ידועות - merkle tree, hash table, public key encryption.\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e495",
//     title: "BI.Compare",
//     imageSrc:
//       "https://static.wixstatic.com/media/7cef49_b9adf53ee2cf4e6d8d84a16a2f1ecea5~mv2.jpeg/v1/fill/w_274,h_161,al_c,q_80,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211110",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "תמיר שחם דניאל ציון יובל שלוסר",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פתרונות תוכנה מתקדמים",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'המוצר שפיתחנו הוא כלי עזר לעסקים שמוכרים את מוצריהם ללקוחות ברחבי העולם, המאפשר ניתוח פעילות מול חברות משלוחים. המשתמשים פועלים בסביבת עבודה מאובטחת ועם רמות שונות של הרשאות. ניתן להעלות או למחוק נתונים גולמיים אודות היסטורית המשלוחים עם חברות משלוח שונות. המוצר כולל ממשק משתמש נוח לוויזואליזציה של נתונים רלוונטיים באמצעות גרפים אותם בנינו להשוואה נוחה וקלה בין חברות משלוחים ע"פ פרמטרים שונים.\n\nאת ממשק המשתמש פיתחנו באמצעות JavaScript ו- React. ליצירת הגרפים השתמשנו בספרית Chart.js. כמו כן, השתמשנו ב- AWS Amplify לניהול התחברות והרשמה. \n\nלצורך כתיבת צד השרת השתמשנו בשפת Typescript וב-Node.js וNestJs. בעזרת  ספריית Express המובנה בNestJs מימשנו API איתו מתקשר ממשק המשתמש בצד הלקוח לצורך העלאת קבצים ושליפות מידע. כמו כן, מימשנו חיבור לבסיס נתונים MongoDB שבו נשמרים הנתונים הגולמיים אותם מעלה המשתמש כקובץ csv. כמו כן השתמשנו בAWS לצורך - פריסת הקוד בעזרת EC2, שליחת התראות באימייל באמצעות SES ושמירת לוגים בענן באמצעות S3\n\n',
//       },
//     ],
//   },
//   {
//     status: "approved",
//     teacherId: "613ce0fd6b3ab6b59152e486",
//     workshopId: "613ce0fd6b3ab6b59152e495",
//     title: "Masked Face Recognition System",
//     imageSrc:
//       "https://static.wixstatic.com/media/b4b3ff_9c9884e6abcd49e8beeeef5b31f4538d~mv2.png/v1/fill/w_274,h_161,al_c,q_85,usm_0.66_1.00_0.01/H7900532_logos_72_dpi_HE.webp",
//     details: [
//       {
//         key: "211106",
//         value: ":מספר הפרויקט",
//       },
//       {
//         key: "ליאור שמנוב",
//         value: ":שמות הסטודנטים המציגים",
//       },
//       {
//         key: 'ד"ר קירש אילן',
//         value: ":שם המנחה",
//       },
//       {
//         key: "פתרונות תוכנה מתקדמים",
//         value: ":שם הסדנה",
//       },
//       {
//         key: ":GitHub",
//         value: "https://github.com/liorsl1/MFR-Seminar-Project",
//       },
//       {
//         key: ":תקציר הפרויקט",
//         value:
//           'הפרויקט הינו מערכת לזיהוי ואימות פנים המכוסות במסיכה (מסיכת נשימה / "מסיכת קורונה"), רעיון שעלה בהשראת תקופת הקורונה.\n\nהזיהוי מתבצע תוך שימוש באלגוריתמי ראייה ממוחשבת קלאסיים בשילוב למידה עמוקה, ובאמצעות בספריית OpenCV. נתונים נשמרים בבסיס נתונים MongoDB. המערכת נגישה כאפליקציית Web.\n\nשיטת הזיהוי הייחודיות שפותחה לצורך הפרויקט מתבססת על חישוב מרחקים בין ייצוג חלק הפנים שאינו מכוסה ע"י המסיכה לחלק המקביל בצילומים המסווגים שבבסיס הנתונים. שיטה זו מהירה ויעילה יותר באופן משמעותי משיטות אחרות, ולמרות האתגר בזיהוי פנים מכוסות חלקית - אחוזי ההצלחה גבוהים.\nהפרוייקט נכתב כולו ב-Python.',
//       },
//     ],
//   },
// ];

// const b = a.map((project) => {
//   const studentNameArr = project.details[1].key.split(" ");
//   let studentsArr = [];
//   let i = 0;
//   while (i < studentNameArr.length) {
//     studentsArr.push({
//       firstName: studentNameArr[i],
//       lastName: studentNameArr[i + 1],
//       mail: "",
//       id: "",
//     });
//     i += 2;
//   }

//   return {
//     title: project.title,
//     imgLink: project.imageSrc,
//     teacherId: project.teacherId,
//     workshopId: project.workshopId,
//     preview: project.details[5].value,
//     status: project.status,
//     githubLink: project.details[4].value,
//     contactEmail: "Danii1415@gmail.com",
//     contactName: "Daniel Kfir",
//     contactPhone: "0505591212",
//     imageIsOld: true,
//     lastUpdateByStudent: Date.now().toString(),
//     studentList: studentsArr,
//   };
// });

const App = () => {
  const dispatch = useDispatch();

  // useEffect(() => {
  //   const postMessage = async () => {
  //     for (const project of b) {
  //       try {
  //         const res = await Axios.post("http://localhost:5000/projects/", {
  //           title: project.title,
  //           imgLink: project.imgLink,
  //           teacherId: project.teacherId,
  //           workshopId: project.workshopId,
  //           preview: project.preview,
  //           status: project.status,
  //           githubLink: project.githubLink,
  //           contactEmail: project.contactEmail,
  //           contactName: project.contactName,
  //           contactPhone: project.contactPhone,
  //           imageIsOld: project.imageIsOld,
  //           lastUpdateByStudent: project.lastUpdateByStudent,
  //           studentList: project.studentList,
  //         });
  //         // const res = await Axios.post("http://localhost:5000/projects/", project);
  //         if (res && res.data) {
  //           console.log(res.data);
  //         }
  //       } catch (e) {
  //         console.log(e);
  //       }
  //     }
  //   };
  //   postMessage();
  // }, []);

  useEffect(() => {
    if (localStorage.getItem("loggedInTeacher")) {
      dispatch(teacherLogin(localStorage.getItem("loggedInTeacher")));
    }
  }, []);

  return (
    <BrowserRouter>
      <Navbar />
      <div className="container">
        <Switch>
          <Route exact path="/" component={AllProjects} />
          <Route
            exact
            path="/DisplayProject/:projectId"
            component={DisplayProject}
          />
          <Route exact path="/Signin" component={SignIn} />
          <Route exact path="/Addproject" component={AddProject} />
          <Route exact path="/EditProject/:projectId" component={EditProject} />
          <Route
            exact
            path="/:teacherId/Projects"
            component={TeacherProjects}
          />
        </Switch>
      </div>
    </BrowserRouter>
  );
};

export default App;
