import React from "react";

const teacherMessages = [
  {
    date: "11/8/21 19:40",
    message:
      "צריך לעשות דברים בצורה אחרת תוסיפו ככה ותעשו ככה ואחרי זה תוסיפו עוד דברים",
  },
  {
    date: "11/8/21 21:53",
    message:
      "אני ושגיב עושים את הפרויקט, הוא עושה בקאנד ואני פרונטאנד ומקווים מאוד שקירש לא יכעס עלינו",
  },
  {
    date: "13/8/21 11:01",
    message:
      "צריך לעשות דברים בצורה אחרת תוסיפו ככה ותעשו ככה ואחרי זה תוסיפו עוד דברים",
  },
];

const EditPreview = () => {};

export default EditPreview;
